-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th5 14, 2026 lúc 12:26 PM
-- Phiên bản máy phục vụ: 10.4.32-MariaDB
-- Phiên bản PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `saodo_equipment`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `audit_logs`
--

CREATE TABLE `audit_logs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `plan_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `action` varchar(255) NOT NULL,
  `comment` text DEFAULT NULL,
  `timestamp` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `audit_logs`
--

INSERT INTO `audit_logs` (`id`, `plan_id`, `user_id`, `action`, `comment`, `timestamp`, `created_at`, `updated_at`) VALUES
(81, 27, 75, 'Cập nhật kế hoạch', NULL, '2026-05-05 04:37:40', '2026-05-04 21:37:40', '2026-05-04 21:37:40'),
(82, 27, 75, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 04:37:41', '2026-05-04 21:37:41', '2026-05-04 21:37:41'),
(83, 28, 7, 'Cập nhật kế hoạch', NULL, '2026-05-05 04:40:27', '2026-05-04 21:40:27', '2026-05-04 21:40:27'),
(84, 28, 7, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 04:40:28', '2026-05-04 21:40:28', '2026-05-04 21:40:28'),
(85, 30, 5, 'Cập nhật kế hoạch', NULL, '2026-05-05 04:42:16', '2026-05-04 21:42:16', '2026-05-04 21:42:16'),
(86, 30, 5, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 04:42:16', '2026-05-04 21:42:16', '2026-05-04 21:42:16'),
(87, 31, 9, 'Cập nhật kế hoạch', NULL, '2026-05-05 04:45:20', '2026-05-04 21:45:20', '2026-05-04 21:45:20'),
(88, 31, 9, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 04:45:20', '2026-05-04 21:45:20', '2026-05-04 21:45:20'),
(89, 32, 4, 'Cập nhật kế hoạch', NULL, '2026-05-05 04:47:37', '2026-05-04 21:47:37', '2026-05-04 21:47:37'),
(90, 32, 4, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 04:47:37', '2026-05-04 21:47:37', '2026-05-04 21:47:37'),
(91, 33, 8, 'Cập nhật kế hoạch', NULL, '2026-05-05 04:50:07', '2026-05-04 21:50:07', '2026-05-04 21:50:07'),
(92, 33, 8, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 04:50:08', '2026-05-04 21:50:08', '2026-05-04 21:50:08'),
(93, 35, 11, 'Cập nhật kế hoạch', NULL, '2026-05-05 04:52:06', '2026-05-04 21:52:06', '2026-05-04 21:52:06'),
(94, 35, 11, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 04:52:07', '2026-05-04 21:52:07', '2026-05-04 21:52:07'),
(95, 36, 10, 'Cập nhật kế hoạch', NULL, '2026-05-05 04:53:48', '2026-05-04 21:53:48', '2026-05-04 21:53:48'),
(96, 36, 10, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 04:53:49', '2026-05-04 21:53:49', '2026-05-04 21:53:49'),
(97, 30, 5, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:02:36', '2026-05-04 22:02:36', '2026-05-04 22:02:36'),
(98, 30, 5, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:02:37', '2026-05-04 22:02:37', '2026-05-04 22:02:37'),
(99, 27, 75, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:04:41', '2026-05-04 22:04:41', '2026-05-04 22:04:41'),
(100, 27, 75, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:04:41', '2026-05-04 22:04:41', '2026-05-04 22:04:41'),
(101, 28, 7, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:06:03', '2026-05-04 22:06:03', '2026-05-04 22:06:03'),
(102, 28, 7, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:06:04', '2026-05-04 22:06:04', '2026-05-04 22:06:04'),
(103, 30, 5, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:07:30', '2026-05-04 22:07:30', '2026-05-04 22:07:30'),
(104, 30, 5, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:07:30', '2026-05-04 22:07:30', '2026-05-04 22:07:30'),
(105, 31, 9, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:08:29', '2026-05-04 22:08:29', '2026-05-04 22:08:29'),
(106, 31, 9, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:08:29', '2026-05-04 22:08:29', '2026-05-04 22:08:29'),
(107, 38, 49, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:13:31', '2026-05-04 22:13:31', '2026-05-04 22:13:31'),
(108, 38, 49, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:13:31', '2026-05-04 22:13:31', '2026-05-04 22:13:31'),
(109, 38, 49, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:13:46', '2026-05-04 22:13:46', '2026-05-04 22:13:46'),
(110, 38, 49, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:13:46', '2026-05-04 22:13:46', '2026-05-04 22:13:46'),
(111, 39, 51, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:17:02', '2026-05-04 22:17:02', '2026-05-04 22:17:02'),
(112, 39, 51, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:17:03', '2026-05-04 22:17:03', '2026-05-04 22:17:03'),
(113, 40, 40, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:21:21', '2026-05-04 22:21:21', '2026-05-04 22:21:21'),
(114, 40, 40, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:21:22', '2026-05-04 22:21:22', '2026-05-04 22:21:22'),
(115, 40, 40, 'Cập nhật kế hoạch', NULL, '2026-05-05 05:23:09', '2026-05-04 22:23:09', '2026-05-04 22:23:09'),
(116, 40, 40, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 05:23:09', '2026-05-04 22:23:09', '2026-05-04 22:23:09'),
(117, 40, 40, 'Cập nhật trạng thái: COMPLETED', '', '2026-05-05 05:25:28', '2026-05-04 22:25:28', '2026-05-04 22:25:28'),
(118, 28, 7, 'Cập nhật kế hoạch', NULL, '2026-05-05 07:43:19', '2026-05-05 00:43:19', '2026-05-05 00:43:19'),
(119, 28, 7, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-05 07:43:20', '2026-05-05 00:43:20', '2026-05-05 00:43:20'),
(120, 44, 75, 'Cập nhật kế hoạch', NULL, '2026-05-06 00:21:14', '2026-05-05 17:21:14', '2026-05-05 17:21:14'),
(121, 44, 75, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-06 00:21:14', '2026-05-05 17:21:14', '2026-05-05 17:21:14'),
(122, 44, 75, 'Cập nhật trạng thái: COMPLETED', '', '2026-05-06 00:21:23', '2026-05-05 17:21:23', '2026-05-05 17:21:23'),
(123, 47, 32, 'Cập nhật kế hoạch', NULL, '2026-05-08 03:42:47', '2026-05-07 20:42:47', '2026-05-07 20:42:47'),
(124, 47, 32, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-08 03:42:47', '2026-05-07 20:42:47', '2026-05-07 20:42:47'),
(125, 47, 32, 'Cập nhật kế hoạch', NULL, '2026-05-08 03:45:58', '2026-05-07 20:45:58', '2026-05-07 20:45:58'),
(126, 47, 32, 'Cập nhật kế hoạch', NULL, '2026-05-08 03:46:55', '2026-05-07 20:46:55', '2026-05-07 20:46:55'),
(127, 47, 32, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-08 03:46:55', '2026-05-07 20:46:55', '2026-05-07 20:46:55'),
(128, 47, 14, 'Cập nhật trạng thái: DEPT_APPROVED_TO_BGH', 'Đã xem xét và phê duyệt.', '2026-05-08 03:50:14', '2026-05-07 20:50:14', '2026-05-07 20:50:14'),
(129, 48, 65, 'Cập nhật kế hoạch', NULL, '2026-05-08 07:12:45', '2026-05-08 00:12:45', '2026-05-08 00:12:45'),
(130, 48, 65, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-08 07:12:46', '2026-05-08 00:12:46', '2026-05-08 00:12:46'),
(131, 48, 65, 'Cập nhật kế hoạch', NULL, '2026-05-08 07:15:14', '2026-05-08 00:15:14', '2026-05-08 00:15:14'),
(132, 48, 65, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-08 07:15:15', '2026-05-08 00:15:15', '2026-05-08 00:15:15'),
(133, 52, 77, 'Cập nhật kế hoạch', NULL, '2026-05-10 13:07:28', '2026-05-10 06:07:28', '2026-05-10 06:07:28'),
(134, 52, 77, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-10 13:07:29', '2026-05-10 06:07:29', '2026-05-10 06:07:29'),
(135, 52, 76, 'Cập nhật trạng thái: DEPT_APPROVED_TO_BGH', 'Đã xem xét và phê duyệt.', '2026-05-10 13:07:47', '2026-05-10 06:07:47', '2026-05-10 06:07:47'),
(136, 48, 65, 'Cập nhật kế hoạch', NULL, '2026-05-13 03:15:58', '2026-05-12 20:15:58', '2026-05-12 20:15:58'),
(137, 48, 65, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-13 03:15:59', '2026-05-12 20:15:59', '2026-05-12 20:15:59'),
(138, 53, 30, 'Cập nhật kế hoạch', NULL, '2026-05-13 03:22:29', '2026-05-12 20:22:29', '2026-05-12 20:22:29'),
(139, 53, 30, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-13 03:22:29', '2026-05-12 20:22:29', '2026-05-12 20:22:29'),
(140, 53, 30, 'Cập nhật kế hoạch', NULL, '2026-05-13 03:23:30', '2026-05-12 20:23:30', '2026-05-12 20:23:30'),
(141, 53, 30, 'Cập nhật trạng thái: SUBMITTED', '', '2026-05-13 03:23:30', '2026-05-12 20:23:30', '2026-05-12 20:23:30');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `departments`
--

CREATE TABLE `departments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `code` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `departments`
--

INSERT INTO `departments` (`id`, `name`, `code`, `created_at`, `updated_at`) VALUES
(1, 'Khoa Điện', 'KD', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(2, 'Khoa Cơ khí', 'KCK', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(3, 'Khoa May và Thời trang', 'KMT', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(4, 'Khoa Công nghệ thông tin', 'CNTT', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(5, 'Khoa Ô tô', 'KOT', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(7, 'Phòng Quản lý chất lượng', 'QLCL', '2026-04-14 19:05:06', '2026-04-14 19:05:06');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `equipment`
--

CREATE TABLE `equipment` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `code` varchar(255) DEFAULT NULL,
  `year_of_use` int(11) DEFAULT NULL,
  `location_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `equipment`
--

INSERT INTO `equipment` (`id`, `name`, `code`, `year_of_use`, `location_id`, `created_at`, `updated_at`) VALUES
(1, 'Bộ PLC Mitsubishi + cảm biến phòng chống cháy', 'PLC-CB-01', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(2, 'Bộ PLC Mitsubishi + bảng gia công áp lực', 'PLC-GC-02', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(3, 'Bộ PLC S7-1200 + máy tính điều khiển nhiệt độ lò', 'S71200-01', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(4, 'PLC Mitsubishi + màn hình HMI Winview', 'HMI-WIN-01', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(5, 'PLC Mitsubishi + bảng gia công áp lực (2)', 'PLC-GC-03', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(6, 'Bộ PLC S7-1200 điều khiển nhiệt độ lò (2)', 'S71200-02', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(7, 'Bộ PLC Biến tần truyền thông', 'PLC-BT-01', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(8, 'PLC Mitsubishi FX3G + phần mềm GX Works2', 'FX3G-01', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(9, 'PLC S7-1200 + Zen + Logo cắt nguồn dự phòng', 'ZEN-01', 2016, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(10, 'Cánh tay Robot + QR scanner + Động cơ Servo', 'ROBOT-01', 2017, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(11, 'Máy CNC (P.TH CNC-X4)', 'CNC-01', 2018, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(12, 'Băng tải + PLC 305B', 'PLC-305B', 2019, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `locations`
--

CREATE TABLE `locations` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `code` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `locations`
--

INSERT INTO `locations` (`id`, `name`, `code`, `created_at`, `updated_at`) VALUES
(1, '101-X1', '101-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(2, '102-X1', '102-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(3, '103-X1', '103-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(4, '104-X1', '104-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(5, '106-X1', '106-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(6, '108-X1', '108-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(7, '201-X1', '201-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(8, '202-X1', '202-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(9, '203-X1', '203-X1', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(10, '101-X3', '101-X3', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(11, 'P.TH CNC-X4', 'P.TH CNC-X4', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(12, 'P. làm việc-X3', 'P. làm việc-X3', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(13, '305B', '305B', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(14, '201-X4', '201-X4', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(15, '202-X4', '202-X4', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(16, '203-X4', '203-X4', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(17, '207-X4', '207-X4', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(18, 'Văn phòng khoa', 'Văn phòng khoa', '2026-04-13 23:54:34', '2026-04-13 23:54:34'),
(19, 'Phòng thực hành điện', 'Phòng thực hành điện', '2026-04-13 23:54:34', '2026-04-13 23:54:34');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2024_01_01_000000_create_system_tables', 1),
(2, '2026_04_11_111733_add_status_to_users_table', 1),
(3, '2026_04_12_000000_add_attachments_to_plans', 1),
(4, '2026_04_12_083900_add_avatar_to_users_table', 1),
(5, '2026_04_12_103200_add_attachments_column_to_plans', 1),
(6, '2026_04_13_124820_add_profile_fields_to_users_table', 1),
(7, '2026_04_13_210000_create_user_activities_table', 1);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `personal_access_tokens`
--

INSERT INTO `personal_access_tokens` (`id`, `tokenable_type`, `tokenable_id`, `name`, `token`, `abilities`, `last_used_at`, `expires_at`, `created_at`, `updated_at`) VALUES
(1, 'App\\Models\\User', 6, 'auth-token', 'e4ac9a78703c40fdb72b5aab0cdae12e3940f3a1ab3c16b030e2d827cf5cdf8e', '[\"*\"]', '2026-04-14 01:38:20', NULL, '2026-04-14 01:37:35', '2026-04-14 01:38:20'),
(2, 'App\\Models\\User', 3, 'auth-token', '83c177cc1da7542f8b688a7b36b265159a9e5d774606f11946455f86bfccee02', '[\"*\"]', '2026-04-14 01:38:51', NULL, '2026-04-14 01:38:35', '2026-04-14 01:38:51'),
(3, 'App\\Models\\User', 5, 'auth-token', 'c7f57774e87efff5812dd9d4453b3ca756db16316b9167419ccb8eb4b366ae03', '[\"*\"]', '2026-04-14 01:39:38', NULL, '2026-04-14 01:39:03', '2026-04-14 01:39:38'),
(4, 'App\\Models\\User', 4, 'auth-token', '35dfe4b56115650a1d2ebbd872db20e7bee3ce46df091b35c9573c19e677617e', '[\"*\"]', '2026-04-14 01:40:28', NULL, '2026-04-14 01:39:51', '2026-04-14 01:40:28'),
(5, 'App\\Models\\User', 2, 'auth-token', 'fae74c4fdc545d709a58618483667fed6db5e5620a89aa0d0b69bb7679d82c46', '[\"*\"]', '2026-04-14 01:48:15', NULL, '2026-04-14 01:46:04', '2026-04-14 01:48:15'),
(6, 'App\\Models\\User', 12, 'auth-token', '61b1f5cb31a747754464ad811ff1de5dd0280b8269b4596a6d4cb2c766bae598', '[\"*\"]', '2026-04-14 01:49:09', NULL, '2026-04-14 01:48:20', '2026-04-14 01:49:09'),
(7, 'App\\Models\\User', 3, 'auth-token', 'cca41598b422d4def3ce389d8d7edcbfa49ece33e783a3e26526e6a8b24d99e9', '[\"*\"]', '2026-04-14 01:50:38', NULL, '2026-04-14 01:49:24', '2026-04-14 01:50:38'),
(8, 'App\\Models\\User', 2, 'auth-token', '99ebd413688f557574d01bca20e7458fb9866c4bd5adac0e8a1b491b02c06ee3', '[\"*\"]', '2026-04-14 01:51:30', NULL, '2026-04-14 01:50:59', '2026-04-14 01:51:30'),
(9, 'App\\Models\\User', 3, 'auth-token', '2a0f3d3c5675a6eb7379dd7810c715e2f125d138d67020efb443772333283344', '[\"*\"]', '2026-04-14 01:52:58', NULL, '2026-04-14 01:51:41', '2026-04-14 01:52:58'),
(10, 'App\\Models\\User', 2, 'auth-token', '1ad1e06426fa9db74ce9af58c08c4656acb713cbc2e44dd1b6ed947083125e00', '[\"*\"]', '2026-04-14 01:54:22', NULL, '2026-04-14 01:53:20', '2026-04-14 01:54:22'),
(11, 'App\\Models\\User', 13, 'auth-token', 'ae23dd4e3875fcbd4c3aa387cd2e0fd7462f3dd4c6b8d01e3533c0961ce366da', '[\"*\"]', NULL, NULL, '2026-04-14 17:17:27', '2026-04-14 17:17:27'),
(12, 'App\\Models\\User', 6, 'auth-token', '301f63e25d56836388279d9b619445889292e1789ddd8ef69260d756d1724044', '[\"*\"]', '2026-04-14 17:17:52', NULL, '2026-04-14 17:17:51', '2026-04-14 17:17:52'),
(13, 'App\\Models\\User', 2, 'auth-token', '1feff13c6e9adaab7dd59b63eb25881f7a4761e738e57d929d236c43586c7ad2', '[\"*\"]', '2026-04-14 17:19:09', NULL, '2026-04-14 17:18:35', '2026-04-14 17:19:09'),
(14, 'App\\Models\\User', 13, 'auth-token', 'e4aee16e1e6aea38485ecda28dbbdbbb2202a19844ad26c820e67d2a625a7092', '[\"*\"]', '2026-04-14 17:20:00', NULL, '2026-04-14 17:19:21', '2026-04-14 17:20:00'),
(15, 'App\\Models\\User', 14, 'auth-token', '45239708abec97a37cc05b6c44b48e2508eb46f0b724090ef34afb813bffd2d5', '[\"*\"]', '2026-04-14 17:20:22', NULL, '2026-04-14 17:20:06', '2026-04-14 17:20:22'),
(16, 'App\\Models\\User', 16, 'auth-token', '41c1e99e5c49a26d7cd68a64da9af4555c1ee3cc4c96b4f5f360ff56c77ce30f', '[\"*\"]', '2026-04-14 17:20:58', NULL, '2026-04-14 17:20:37', '2026-04-14 17:20:58'),
(17, 'App\\Models\\User', 15, 'auth-token', '19e9c6e63294694be3bb829a47cd04cd590965a757a23b06b698d58be0a4b18c', '[\"*\"]', '2026-04-14 17:21:43', NULL, '2026-04-14 17:21:25', '2026-04-14 17:21:43'),
(18, 'App\\Models\\User', 3, 'auth-token', 'ac1f71bfc286520d4a757d14bfca13968a6172ae5446240cdbfe58a2909d138e', '[\"*\"]', '2026-04-14 17:22:42', NULL, '2026-04-14 17:22:02', '2026-04-14 17:22:42'),
(19, 'App\\Models\\User', 2, 'auth-token', '432aa45f48d3fd409338c880ea0210411c328e69c86840201110e09dc1acdb5e', '[\"*\"]', '2026-04-14 17:24:02', NULL, '2026-04-14 17:23:31', '2026-04-14 17:24:02'),
(20, 'App\\Models\\User', 16, 'auth-token', 'a3d1c8be565131091354c469407403d3a2cd9eb4e129755819acbd768293a5bc', '[\"*\"]', '2026-04-14 17:24:52', NULL, '2026-04-14 17:24:24', '2026-04-14 17:24:52'),
(21, 'App\\Models\\User', 2, 'auth-token', 'e168aee4cf6c7d1a50757b23223778a87fdb0b04f846a5b4bc02c2fef514001a', '[\"*\"]', '2026-04-14 17:25:24', NULL, '2026-04-14 17:25:05', '2026-04-14 17:25:24'),
(22, 'App\\Models\\User', 2, 'auth-token', 'cb2187328821aa3693cb779332aee6ecab6de5752b4f917a7711b049669bcec9', '[\"*\"]', '2026-04-14 17:26:11', NULL, '2026-04-14 17:26:08', '2026-04-14 17:26:11'),
(23, 'App\\Models\\User', 16, 'auth-token', '7295cbb3adf36b2842826a46b63cd3c63d2df9f5b3d5d3c217f96d2bd719352b', '[\"*\"]', '2026-04-14 17:26:41', NULL, '2026-04-14 17:26:25', '2026-04-14 17:26:41'),
(24, 'App\\Models\\User', 16, 'auth-token', '42978b9ed4b6c434daaf8cc2d551cd040dec6619d9aec92ab3e5a40aeed5874e', '[\"*\"]', '2026-04-14 17:29:18', NULL, '2026-04-14 17:29:10', '2026-04-14 17:29:18'),
(25, 'App\\Models\\User', 2, 'auth-token', 'efa7bc761dfb7a47ea59876765523f8aacf5ffffa8646af4458a6d59795d04d1', '[\"*\"]', '2026-04-14 18:36:58', NULL, '2026-04-14 17:29:29', '2026-04-14 18:36:58'),
(26, 'App\\Models\\User', 6, 'auth-token', '13e330933e4d5280f3d50398605f403c32cf3e9b27281c97b5286df508793dab', '[\"*\"]', '2026-04-14 18:44:22', NULL, '2026-04-14 18:39:22', '2026-04-14 18:44:22'),
(27, 'App\\Models\\User', 12, 'auth-token', 'bf9286771fb882c089a4aa85772b7ed90bb2f6953ef76a223d55a5e80a8cb31b', '[\"*\"]', '2026-04-14 19:00:54', NULL, '2026-04-14 19:00:37', '2026-04-14 19:00:54'),
(28, 'App\\Models\\User', 16, 'auth-token', '548f4de308596df2f66b6b6061a848fcb5be3bdd65335f96dd4ca8d8f959e08d', '[\"*\"]', '2026-04-14 19:01:18', NULL, '2026-04-14 19:01:02', '2026-04-14 19:01:18'),
(29, 'App\\Models\\User', 2, 'auth-token', '375b46cf5454fdcfef8c2aaf12448870b6eb380054c41c6ed5154ff64cc115ca', '[\"*\"]', '2026-04-14 19:05:47', NULL, '2026-04-14 19:01:48', '2026-04-14 19:05:47'),
(30, 'App\\Models\\User', 2, 'auth-token', 'a80b8b5c14970607085b9876c391e4ea68e294fc1e547824c29aa48e7dd0c2f4', '[\"*\"]', '2026-04-14 19:04:57', NULL, '2026-04-14 19:04:26', '2026-04-14 19:04:57'),
(31, 'App\\Models\\User', 2, 'auth-token', 'c239f16baebff4dfd559e09eaa733d95b6b9336da3be0033e1b9803a69b8fb07', '[\"*\"]', '2026-04-14 19:10:59', NULL, '2026-04-14 19:10:13', '2026-04-14 19:10:59'),
(32, 'App\\Models\\User', 2, 'auth-token', '2ed5f94b913346fb5465d19a1f8862c8f1a621f88a93b2c23a72257cc03f9976', '[\"*\"]', '2026-04-14 19:23:35', NULL, '2026-04-14 19:20:56', '2026-04-14 19:23:35'),
(33, 'App\\Models\\User', 2, 'auth-token', '77061313bc0a5fb2893fd2a7d5ec8847e859d6fdef7098f261f8c3361aadf5f7', '[\"*\"]', '2026-04-14 19:24:51', NULL, '2026-04-14 19:22:20', '2026-04-14 19:24:51'),
(34, 'App\\Models\\User', 2, 'auth-token', '214f0b4f3c1fa7ca9de41f60d61d93e563c100338e1fd7e8a950ad608cfe91ae', '[\"*\"]', '2026-04-14 19:37:52', NULL, '2026-04-14 19:32:50', '2026-04-14 19:37:52'),
(35, 'App\\Models\\User', 2, 'auth-token', '5b83814de1f952fd59851e770c58f261a82f0327d673205235ee37f2e0132a6c', '[\"*\"]', '2026-04-14 22:35:38', NULL, '2026-04-14 19:37:57', '2026-04-14 22:35:38'),
(36, 'App\\Models\\User', 2, 'auth-token', 'da15f0d8b9f85e9f1a118755817909fdc89c58710533797fdbfd547ee121885a', '[\"*\"]', '2026-04-14 19:39:07', NULL, '2026-04-14 19:38:21', '2026-04-14 19:39:07'),
(37, 'App\\Models\\User', 6, 'auth-token', 'ce14653471acdd588874483a08a7bfe88030af6fa2b4c5dd982eff922c3597b3', '[\"*\"]', '2026-04-14 19:50:04', NULL, '2026-04-14 19:39:25', '2026-04-14 19:50:04'),
(38, 'App\\Models\\User', 2, 'auth-token', 'f46bec3e656a9c2b322703c01f550906fdef9462be1bcd6c552c60f9b0e2c0ae', '[\"*\"]', '2026-04-16 02:12:16', NULL, '2026-04-16 02:11:45', '2026-04-16 02:12:16'),
(39, 'App\\Models\\User', 2, 'auth-token', '953d541337978af3702066c35c3b4a191b2cb99874e820001ba315fb44f06700', '[\"*\"]', '2026-04-16 02:12:37', NULL, '2026-04-16 02:12:33', '2026-04-16 02:12:37'),
(40, 'App\\Models\\User', 12, 'auth-token', 'd71810566fa7e31c39b512e00f9d69aca981573061966ad2992dcbbc7c0250cb', '[\"*\"]', '2026-04-16 02:16:19', NULL, '2026-04-16 02:12:49', '2026-04-16 02:16:19'),
(41, 'App\\Models\\User', 12, 'auth-token', 'ef85fe1a212e3a004b971cc34af9df9daece1208d411de99cd64539df5e122ac', '[\"*\"]', '2026-04-21 18:23:16', NULL, '2026-04-16 02:28:05', '2026-04-21 18:23:16'),
(42, 'App\\Models\\User', 6, 'auth-token', '1368c6822b1d6ab62fe7664a5253b789fbf0d27209b129da2d4db347d7c31d5b', '[\"*\"]', '2026-04-16 02:29:12', NULL, '2026-04-16 02:29:04', '2026-04-16 02:29:12'),
(43, 'App\\Models\\User', 12, 'auth-token', '5b462152b39a9254af15eed74209048f636c14772edb245614c4601eb7f96b28', '[\"*\"]', '2026-04-16 02:29:39', NULL, '2026-04-16 02:29:23', '2026-04-16 02:29:39'),
(44, 'App\\Models\\User', 2, 'auth-token', '985794ee4688d84ad368a3d26543c20e00a0e5a9f4a6b2b7f014719f1d837541', '[\"*\"]', '2026-04-16 02:39:56', NULL, '2026-04-16 02:30:21', '2026-04-16 02:39:56'),
(45, 'App\\Models\\User', 72, 'auth-token', '4abb9a0bf4b3ef4a3d93cbcc2ef105920ba061b1103c46d77a31ce61362a9d77', '[\"*\"]', '2026-04-16 02:38:14', NULL, '2026-04-16 02:38:14', '2026-04-16 02:38:14'),
(46, 'App\\Models\\User', 6, 'auth-token', 'fb57d953219f430fcaacc5ea8ce9597f62ed19bf24ffe69c29d07bbd1c7aff66', '[\"*\"]', '2026-04-20 22:21:44', NULL, '2026-04-16 02:40:11', '2026-04-20 22:21:44'),
(47, 'App\\Models\\User', 72, 'auth-token', '7ceafd2a67c82a37b591a723ce58bcab4fae16b049797ca127d428e9f5315beb', '[\"*\"]', '2026-05-10 19:02:38', NULL, '2026-04-20 19:33:55', '2026-05-10 19:02:38'),
(48, 'App\\Models\\User', 12, 'auth-token', 'ac113ffeb0e806164497421539d57df794e210a7a4e58d21d2b27e41905b09ae', '[\"*\"]', '2026-04-20 22:27:25', NULL, '2026-04-20 22:22:01', '2026-04-20 22:27:25'),
(49, 'App\\Models\\User', 72, 'auth-token', 'cbd51d7d5846923aa2c7a408d0637f53a1620bb605aabd035abe679af829e09f', '[\"*\"]', '2026-04-20 22:35:00', NULL, '2026-04-20 22:27:38', '2026-04-20 22:35:00'),
(50, 'App\\Models\\User', 60, 'auth-token', 'c8d9c0959bb26768f65087a98733f7ed4d693b167658405f07b7b6c130eb8734', '[\"*\"]', '2026-04-20 22:45:45', NULL, '2026-04-20 22:45:26', '2026-04-20 22:45:45'),
(51, 'App\\Models\\User', 13, 'auth-token', '0c4faa524a5604c0f7c1040a07f5ac95e62ef4490717f2440addfaa2c9482ca9', '[\"*\"]', '2026-04-20 22:46:31', NULL, '2026-04-20 22:46:00', '2026-04-20 22:46:31'),
(52, 'App\\Models\\User', 2, 'auth-token', 'cb658b7498a8e70e0eeba55e95e1a2f22d586b2b8fc6ccddfa296bf216bbe75e', '[\"*\"]', '2026-04-21 19:06:13', NULL, '2026-04-20 22:46:53', '2026-04-21 19:06:13'),
(53, 'App\\Models\\User', 6, 'auth-token', '8b2c420d2bc1b4a5a67990c0022a2f89d4882fd6dfa0824a74bc9c8a89efdbd5', '[\"*\"]', '2026-04-21 17:53:48', NULL, '2026-04-21 17:47:59', '2026-04-21 17:53:48'),
(54, 'App\\Models\\User', 12, 'auth-token', '2ca401e483f4e0553de4adfdf2c0a91ce526542e0cff8f5f51d8f9bd17f4977e', '[\"*\"]', '2026-04-21 17:54:58', NULL, '2026-04-21 17:54:07', '2026-04-21 17:54:58'),
(55, 'App\\Models\\User', 4, 'auth-token', '5334d43e4588a9af1e41b069ef37907a9f25ec005ff8dc9c763733f3497de543', '[\"*\"]', '2026-04-21 17:57:42', NULL, '2026-04-21 17:55:12', '2026-04-21 17:57:42'),
(56, 'App\\Models\\User', 12, 'auth-token', '35004d694c24aca1fd4e0fb1c3427216b9ab2bdc94f6f9cf3f18a289be3e179c', '[\"*\"]', '2026-04-21 18:01:10', NULL, '2026-04-21 17:57:54', '2026-04-21 18:01:10'),
(57, 'App\\Models\\User', 72, 'auth-token', '1f4168049440bc3e688e4f05090f7e6a942417269531c613f16e0d542dfb16e2', '[\"*\"]', '2026-04-21 18:01:23', NULL, '2026-04-21 18:01:22', '2026-04-21 18:01:23'),
(58, 'App\\Models\\User', 26, 'auth-token', 'f91aa845f1cd20ecb72478b0ade867b6e181cfc0f738b4e22847f5a026f49cc5', '[\"*\"]', '2026-04-21 18:05:07', NULL, '2026-04-21 18:03:37', '2026-04-21 18:05:07'),
(59, 'App\\Models\\User', 15, 'auth-token', '7418d84ec349a16a68c04bbc4d48acbbb1917ce59ad982672d60cae5094e06e8', '[\"*\"]', '2026-04-21 18:05:23', NULL, '2026-04-21 18:05:14', '2026-04-21 18:05:23'),
(60, 'App\\Models\\User', 72, 'auth-token', '5f91ac581aa930354821a5a20e8f1b2686ce43919e555a11248714d52b3f1d90', '[\"*\"]', '2026-04-21 18:07:23', NULL, '2026-04-21 18:05:41', '2026-04-21 18:07:23'),
(61, 'App\\Models\\User', 2, 'auth-token', '7f0aab52562d71da11d94027a08a4c051ed9e5693409374342c6f06a54bc3147', '[\"*\"]', '2026-04-21 18:10:47', NULL, '2026-04-21 18:07:46', '2026-04-21 18:10:47'),
(62, 'App\\Models\\User', 6, 'auth-token', '1e7d9d12b348c2b269814b1450a47fa77aa64151ca67d0ae6463255dd4e47822', '[\"*\"]', '2026-04-21 18:11:16', NULL, '2026-04-21 18:11:00', '2026-04-21 18:11:16'),
(63, 'App\\Models\\User', 6, 'auth-token', '9c83aa4d2795f1fd7bfc88689a2f309832ee015acc32cc94fcd63ba061e80750', '[\"*\"]', '2026-04-21 18:12:21', NULL, '2026-04-21 18:11:36', '2026-04-21 18:12:21'),
(64, 'App\\Models\\User', 12, 'auth-token', '3ee9823f616c0ae18daffceb424bdd615cee848e72dc3f77c2400f949daadf5d', '[\"*\"]', '2026-04-21 18:12:46', NULL, '2026-04-21 18:12:30', '2026-04-21 18:12:46'),
(65, 'App\\Models\\User', 2, 'auth-token', 'a4c5e06ec5d20ceec23788479004628559b57bd9ffcfc99decd104610593ff6c', '[\"*\"]', '2026-04-21 18:13:08', NULL, '2026-04-21 18:13:01', '2026-04-21 18:13:08'),
(66, 'App\\Models\\User', 6, 'auth-token', 'b59b26ef7aee486729299d3c2f825794731479bcbc52bfc32c1caf99158ce47b', '[\"*\"]', '2026-04-21 18:13:46', NULL, '2026-04-21 18:13:16', '2026-04-21 18:13:46'),
(67, 'App\\Models\\User', 12, 'auth-token', '74fd4513188be1f56211f58e30412493dd65fce53f3673540f55dea5dd10fac7', '[\"*\"]', '2026-04-21 18:15:09', NULL, '2026-04-21 18:13:54', '2026-04-21 18:15:09'),
(68, 'App\\Models\\User', 2, 'auth-token', 'ffdf684fa1ab57a338a16fb3d87aee8fac687641ace9fbff0da18ad449a87d05', '[\"*\"]', '2026-04-21 18:16:26', NULL, '2026-04-21 18:15:24', '2026-04-21 18:16:26'),
(69, 'App\\Models\\User', 8, 'auth-token', '3aba918c02e0321a4d0df2ec3016c8de2f2f4b47b709420d7873bb789b135441', '[\"*\"]', '2026-04-21 18:17:58', NULL, '2026-04-21 18:16:37', '2026-04-21 18:17:58'),
(70, 'App\\Models\\User', 12, 'auth-token', 'c43443970e5db40b2899185ea0e64a70970454d43832e417fd6192c551b2f59f', '[\"*\"]', '2026-04-21 18:18:23', NULL, '2026-04-21 18:18:07', '2026-04-21 18:18:23'),
(71, 'App\\Models\\User', 2, 'auth-token', '9626770604c856e59fb381544542a843a32ac14c12572c2b87827b2282fc0110', '[\"*\"]', '2026-04-21 18:18:44', NULL, '2026-04-21 18:18:40', '2026-04-21 18:18:44'),
(72, 'App\\Models\\User', 8, 'auth-token', '4e053909950dc4a1bc5c18044e0f56b3324a8eb54ca3eabe50f5545d78356fdd', '[\"*\"]', '2026-04-21 18:19:22', NULL, '2026-04-21 18:19:06', '2026-04-21 18:19:22'),
(73, 'App\\Models\\User', 2, 'auth-token', 'a6cd2ae623af0c3db9b8666247e5ef883e419e0813660ac0b4d0cb14d4d7e66a', '[\"*\"]', '2026-04-21 18:21:56', NULL, '2026-04-21 18:19:40', '2026-04-21 18:21:56'),
(74, 'App\\Models\\User', 10, 'auth-token', 'ba40f55469da4e82700f55795f7e172f29adb59d6023b5b0b496f2931b72d6ed', '[\"*\"]', '2026-04-21 18:22:53', NULL, '2026-04-21 18:22:26', '2026-04-21 18:22:53'),
(75, 'App\\Models\\User', 12, 'auth-token', '7d9335aba26fd5db6656fa0601d3fddc01304e67cbfcba98165e0bd5920afe37', '[\"*\"]', '2026-04-21 18:23:09', NULL, '2026-04-21 18:23:02', '2026-04-21 18:23:09'),
(76, 'App\\Models\\User', 2, 'auth-token', '030f2775b1daf9318a71ff957ca3068dbf6124386bc2ef1a2595849c758c6b29', '[\"*\"]', '2026-04-21 18:32:37', NULL, '2026-04-21 18:23:42', '2026-04-21 18:32:37'),
(77, 'App\\Models\\User', 2, 'auth-token', 'dad9f67c45e5ab2d2d173cae6a70938932086081bbdc28114d0cb4a05969645f', '[\"*\"]', '2026-04-24 02:47:43', NULL, '2026-04-21 18:25:44', '2026-04-24 02:47:43'),
(78, 'App\\Models\\User', 72, 'auth-token', 'a47e964a853fad6dc3e979db1f86df76de6cc01385de2ebd6e82a78e937f54dd', '[\"*\"]', '2026-04-21 18:34:03', NULL, '2026-04-21 18:33:01', '2026-04-21 18:34:03'),
(79, 'App\\Models\\User', 72, 'auth-token', '261f6769e64bf92173ade4ad8c5ac8e58b918e0ae6f2c100604f34949cc47d62', '[\"*\"]', '2026-04-21 18:39:16', NULL, '2026-04-21 18:39:15', '2026-04-21 18:39:16'),
(80, 'App\\Models\\User', 6, 'auth-token', '4a03b4000566780cdc1c40594372c1a561a6f94a8cf69c3f9a42cc8eb9112dda', '[\"*\"]', '2026-04-21 18:59:33', NULL, '2026-04-21 18:45:45', '2026-04-21 18:59:33'),
(81, 'App\\Models\\User', 2, 'auth-token', 'f5f25db539ccb976feba304f3bdecbec2f6c607d49ea18974eb3326611d745fb', '[\"*\"]', '2026-04-21 19:13:17', NULL, '2026-04-21 18:56:52', '2026-04-21 19:13:17'),
(82, 'App\\Models\\User', 17, 'auth-token', '7c0c62da16d1d21cd063548e5b64438c5068873d1fb899101da60b6b649bfe70', '[\"*\"]', '2026-04-21 19:08:57', NULL, '2026-04-21 19:06:53', '2026-04-21 19:08:57'),
(83, 'App\\Models\\User', 16, 'auth-token', 'ba4bf28933754bc6c9c44972166bfe095907eb249e79329d11bc0f4de8845141', '[\"*\"]', '2026-04-21 19:10:10', NULL, '2026-04-21 19:09:23', '2026-04-21 19:10:10'),
(84, 'App\\Models\\User', 17, 'auth-token', 'b1480e1cbdb256bf8459393daf592a778b15efd1f89ac29f8c90d72ab3e78ba2', '[\"*\"]', '2026-04-21 19:11:17', NULL, '2026-04-21 19:10:16', '2026-04-21 19:11:17'),
(85, 'App\\Models\\User', 16, 'auth-token', '748664ea72aa38ef9e89d8e2252fbb821c0044beeb38cb60cb7a2ebbb3067cbb', '[\"*\"]', '2026-04-21 19:11:46', NULL, '2026-04-21 19:11:30', '2026-04-21 19:11:46'),
(86, 'App\\Models\\User', 21, 'auth-token', '055c3e71d3558bd5c2f7c46a9f5995333b9178aa062bb22bc15c0bc08e9e6748', '[\"*\"]', '2026-04-21 19:12:54', NULL, '2026-04-21 19:12:00', '2026-04-21 19:12:54'),
(87, 'App\\Models\\User', 16, 'auth-token', 'a9210925730cb56ece73d356784cbd487db46c838d3f386a2a64c5c618b72237', '[\"*\"]', '2026-04-21 19:18:38', NULL, '2026-04-21 19:13:07', '2026-04-21 19:18:38'),
(88, 'App\\Models\\User', 17, 'auth-token', 'a0c59f8611390fa2693d088c2652b383bbe2aaca98873a4d8e68d8217a2b8e18', '[\"*\"]', '2026-04-21 19:20:58', NULL, '2026-04-21 19:20:13', '2026-04-21 19:20:58'),
(89, 'App\\Models\\User', 17, 'auth-token', '64984c24fd83d83fac6eb3330bc5d969affcb47caa0f33472aeb3b0c3244f381', '[\"*\"]', '2026-04-21 19:21:58', NULL, '2026-04-21 19:21:09', '2026-04-21 19:21:58'),
(90, 'App\\Models\\User', 16, 'auth-token', 'ebae340cb89f2009eb4e6b592bc765682794226ea3c5487c32c09c20597a9bd9', '[\"*\"]', '2026-04-21 19:22:45', NULL, '2026-04-21 19:22:14', '2026-04-21 19:22:45'),
(91, 'App\\Models\\User', 72, 'auth-token', 'd3c2171d82a7c601f56109d95aa40651d372a56f5075474820c5d7e15a71fb40', '[\"*\"]', '2026-04-21 19:28:29', NULL, '2026-04-21 19:23:05', '2026-04-21 19:28:29'),
(92, 'App\\Models\\User', 2, 'auth-token', '9d7df5b0248d40a153fdd8e5a25bd76fd8f938803bc3d5489756070807b93e8f', '[\"*\"]', '2026-04-21 19:29:27', NULL, '2026-04-21 19:28:56', '2026-04-21 19:29:27'),
(93, 'App\\Models\\User', 12, 'auth-token', '529671e1e84d50f88998073fb18dc122a572eef49cb6012757374a212017c477', '[\"*\"]', '2026-04-21 19:32:57', NULL, '2026-04-21 19:29:41', '2026-04-21 19:32:57'),
(94, 'App\\Models\\User', 2, 'auth-token', '14c664339b1dfa948a223af8e3d6a94a6e22e38e87eb8e6da91dffe5b7aa27ba', '[\"*\"]', '2026-04-21 22:32:32', NULL, '2026-04-21 19:33:08', '2026-04-21 22:32:32'),
(95, 'App\\Models\\User', 2, 'auth-token', '2f3376b5b2441312c6477a75c7056cd19a39109449a21a13339e0f942a289592', '[\"*\"]', '2026-04-21 22:33:52', NULL, '2026-04-21 22:33:03', '2026-04-21 22:33:52'),
(96, 'App\\Models\\User', 2, 'auth-token', '74308a30bfe01f219f095ce9cc9cdbac76865e9d82c0abe33e4a04e806fcc685', '[\"*\"]', '2026-04-21 22:35:12', NULL, '2026-04-21 22:34:11', '2026-04-21 22:35:12'),
(97, 'App\\Models\\User', 2, 'auth-token', 'd498bc9e51c78fc3a186744f2fe468044c06cf31a66fd8cac41aa1b1f1666aa3', '[\"*\"]', '2026-04-22 19:30:14', NULL, '2026-04-22 19:18:43', '2026-04-22 19:30:14'),
(98, 'App\\Models\\User', 2, 'auth-token', '2d6e09f4f4ef1283127a7b3e665b3ca1544557c294a9194bf2f3bd1a5d3336a4', '[\"*\"]', '2026-05-04 09:47:02', NULL, '2026-04-24 01:43:49', '2026-05-04 09:47:02'),
(99, 'App\\Models\\User', 1, 'auth-token', '206de70c15ce28d6b597a2db4d13800b2360cd91b00c20157f4c99361bf16029', '[\"*\"]', '2026-04-24 02:30:49', NULL, '2026-04-24 02:19:18', '2026-04-24 02:30:49'),
(100, 'App\\Models\\User', 6, 'auth-token', 'e7a82ad85de904add82b15aa492cb8a6a6e0e05fb436e26bc8d5f479f2ef2fc9', '[\"*\"]', '2026-05-04 10:00:37', NULL, '2026-05-04 10:00:36', '2026-05-04 10:00:37'),
(101, 'App\\Models\\User', 12, 'auth-token', 'b9ed1fb918f5bfd040dd22c897a7e258d31f86d720146f03975e16a45359b737', '[\"*\"]', '2026-05-04 10:03:19', NULL, '2026-05-04 10:00:48', '2026-05-04 10:03:19'),
(102, 'App\\Models\\User', 12, 'auth-token', '5a17307015d523bd17e6ecc6264c8b8f85a903ea935cf3864f62e1f8f810d81a', '[\"*\"]', '2026-05-04 10:09:08', NULL, '2026-05-04 10:09:07', '2026-05-04 10:09:08'),
(103, 'App\\Models\\User', 12, 'auth-token', '89e1cfec8a75eca93510518172ab1a31d5535d7682e61298ccf886036734de3c', '[\"*\"]', '2026-05-04 10:14:41', NULL, '2026-05-04 10:13:03', '2026-05-04 10:14:41'),
(104, 'App\\Models\\User', 12, 'auth-token', '9ba25cb1f0c58936d23db9e3ffd78bf19e31a9c9ed2a4232953e188e73a6eeea', '[\"*\"]', '2026-05-04 10:15:11', NULL, '2026-05-04 10:14:55', '2026-05-04 10:15:11'),
(105, 'App\\Models\\User', 75, 'auth-token', 'd508f66d6953bc0665e8b98b74478c9e823f1f6cd9c0554d546fd199dc819b9f', '[\"*\"]', '2026-05-04 10:17:10', NULL, '2026-05-04 10:15:25', '2026-05-04 10:17:10'),
(106, 'App\\Models\\User', 2, 'auth-token', '004476ed158ab49de8c163f9c57510296ec1f5e6a1079b017358daa0e67cdcd5', '[\"*\"]', '2026-05-04 10:20:40', NULL, '2026-05-04 10:19:39', '2026-05-04 10:20:40'),
(107, 'App\\Models\\User', 75, 'auth-token', 'a377123fd6916b2c6440da3936560932934e8f43b635470a734ef805f7138380', '[\"*\"]', '2026-05-04 10:47:18', NULL, '2026-05-04 10:21:32', '2026-05-04 10:47:18'),
(108, 'App\\Models\\User', 76, 'auth-token', '23b4ce1fa5aeb9d8f166717e12242e67ad00d335a614003eb32c910ef98f896c', '[\"*\"]', '2026-05-04 10:48:36', NULL, '2026-05-04 10:47:34', '2026-05-04 10:48:36'),
(109, 'App\\Models\\User', 7, 'auth-token', '31a55fd2c6f2f9362d047d099a199d4592d0c2ef2ba22b94257feaf9abecfb69', '[\"*\"]', '2026-05-04 10:54:27', NULL, '2026-05-04 10:48:57', '2026-05-04 10:54:27'),
(110, 'App\\Models\\User', 5, 'auth-token', '29ba300961876b92e3227d5559cea6d8bb9e077f0a10de3208283f6f0a94ff67', '[\"*\"]', '2026-05-04 10:56:13', NULL, '2026-05-04 10:54:43', '2026-05-04 10:56:13'),
(111, 'App\\Models\\User', 4, 'auth-token', '78fce31543385f160c661db774e01a51cc1e7fe790c1fc0f653fb11e8194b638', '[\"*\"]', '2026-05-04 10:58:16', NULL, '2026-05-04 10:56:30', '2026-05-04 10:58:16'),
(112, 'App\\Models\\User', 10, 'auth-token', '32086ab768c9024040c0b6b02acb58e948a55a06078e1d53b7d5e715ebce189a', '[\"*\"]', '2026-05-04 11:00:41', NULL, '2026-05-04 10:58:25', '2026-05-04 11:00:41'),
(113, 'App\\Models\\User', 9, 'auth-token', '3279d97c7991877064dc62bc0bab8d7c6dbdde3ae1477c75ec570cc7c2af6ef2', '[\"*\"]', '2026-05-04 11:02:02', NULL, '2026-05-04 11:00:46', '2026-05-04 11:02:02'),
(114, 'App\\Models\\User', 8, 'auth-token', '69f546f7d90da70d6f6de6984f0b74446d5af46779a566b25f1c06fbd9fd110f', '[\"*\"]', '2026-05-04 11:03:18', NULL, '2026-05-04 11:02:17', '2026-05-04 11:03:18'),
(115, 'App\\Models\\User', 11, 'auth-token', 'c7d3723ba5cb92d4743a8c711762595fdfd6605dd504ae5d88c2fc025027cee2', '[\"*\"]', '2026-05-04 11:05:10', NULL, '2026-05-04 11:03:25', '2026-05-04 11:05:10'),
(116, 'App\\Models\\User', 76, 'auth-token', '5b8f22f205d2d06da477f40f7e3d6420a682c661ab70d68b8057d4471a41ca73', '[\"*\"]', '2026-05-04 11:18:53', NULL, '2026-05-04 11:05:30', '2026-05-04 11:18:53'),
(117, 'App\\Models\\User', 72, 'auth-token', 'e4ed985b5a6eb0e17061ca5cf83b898c06f3c99fad8695d5008f2b4203e6606b', '[\"*\"]', '2026-05-04 11:19:21', NULL, '2026-05-04 11:19:20', '2026-05-04 11:19:21'),
(118, 'App\\Models\\User', 49, 'auth-token', '4f32338f0470ffbcf61cb923fb2ba0530b14f4f275add44bf5dbe11a7ffd06df', '[\"*\"]', '2026-05-04 11:25:05', NULL, '2026-05-04 11:22:34', '2026-05-04 11:25:05'),
(119, 'App\\Models\\User', 51, 'auth-token', '4af6a10bdf82fa2b282a2ae94098fd1f87cd229d867280582613187080f470c0', '[\"*\"]', '2026-05-04 11:28:52', NULL, '2026-05-04 11:25:37', '2026-05-04 11:28:52'),
(120, 'App\\Models\\User', 13, 'auth-token', 'c3d6b8e31e81f41eaa0526860f66d2aad61f79158dae3985795c41eb49b06ec2', '[\"*\"]', '2026-05-04 11:31:28', NULL, '2026-05-04 11:29:27', '2026-05-04 11:31:28'),
(121, 'App\\Models\\User', 72, 'auth-token', '01c26b351372991a39c7f9342a6149b70934414e71dbba8c17f3da9e0da6b091', '[\"*\"]', '2026-05-04 11:35:49', NULL, '2026-05-04 11:31:45', '2026-05-04 11:35:49'),
(122, 'App\\Models\\User', 2, 'auth-token', '3dfa4d8bfc13d4d8b5cd54d00d9c95b6c0761917c8628dfbb8267b0d659d08f9', '[\"*\"]', '2026-05-04 11:39:46', NULL, '2026-05-04 11:36:16', '2026-05-04 11:39:46'),
(123, 'App\\Models\\User', 75, 'auth-token', '8aa635fc39f6d456183bc3e1f84f7dc85968bd69fecacc15ef45f990e61be3c2', '[\"*\"]', '2026-05-04 11:48:29', NULL, '2026-05-04 11:39:58', '2026-05-04 11:48:29'),
(124, 'App\\Models\\User', 72, 'auth-token', 'ee8aa6e90916955fbcc371f1f88fdb30a55834492445d173f78f326fa088a57c', '[\"*\"]', '2026-05-04 11:54:40', NULL, '2026-05-04 11:48:56', '2026-05-04 11:54:40'),
(125, 'App\\Models\\User', 2, 'auth-token', '6adf7bbf43cd70b99c8ef15cdf702328b74eac5be951bbc571a1ca055fd171cd', '[\"*\"]', '2026-05-04 12:02:27', NULL, '2026-05-04 11:56:11', '2026-05-04 12:02:27'),
(126, 'App\\Models\\User', 72, 'auth-token', '06851b0fbc21ced04f413e937bb03ae9160900f211f2171ba5ea7173de0e7e05', '[\"*\"]', '2026-05-04 12:02:58', NULL, '2026-05-04 12:02:58', '2026-05-04 12:02:58'),
(127, 'App\\Models\\User', 2, 'auth-token', '074a834c7db648711005e95f232136efc4846b80f730baa968bdb351d584a69b', '[\"*\"]', '2026-05-04 12:04:12', NULL, '2026-05-04 12:03:26', '2026-05-04 12:04:12'),
(128, 'App\\Models\\User', 72, 'auth-token', '17eec334687850f55a7a41be46a6e85766fac0cd41937ed15d5c712ff1344af3', '[\"*\"]', '2026-05-04 12:05:40', NULL, '2026-05-04 12:04:28', '2026-05-04 12:05:40'),
(129, 'App\\Models\\User', 2, 'auth-token', '146367746e5bce02c111297e34ad3dc1db0c3c173498aebab5ca5387a2a035d0', '[\"*\"]', '2026-05-04 12:06:46', NULL, '2026-05-04 12:06:01', '2026-05-04 12:06:46'),
(130, 'App\\Models\\User', 76, 'auth-token', '10220ba66ade8c901c1f6fbb6ad11993c4253e3294f21d63532415036f3d1e21', '[\"*\"]', '2026-05-04 18:31:49', NULL, '2026-05-04 12:07:01', '2026-05-04 18:31:49'),
(131, 'App\\Models\\User', 75, 'auth-token', 'caed3cc04686b0299f829c45c4896e55c87f960c49421b94f602e666119a3d6d', '[\"*\"]', '2026-05-04 21:10:07', NULL, '2026-05-04 18:32:12', '2026-05-04 21:10:07'),
(132, 'App\\Models\\User', 11, 'auth-token', '29a07fa2aa2dc68ee5437c320eefd1f82efc1617f1b21b96b304a33c67df9edc', '[\"*\"]', '2026-05-04 21:11:04', NULL, '2026-05-04 21:10:18', '2026-05-04 21:11:04'),
(133, 'App\\Models\\User', 7, 'auth-token', '7840620659dad42784c1b7941210e825c6b98b21aaf9f9c1cc674851b4073b49', '[\"*\"]', '2026-05-04 21:11:53', NULL, '2026-05-04 21:11:15', '2026-05-04 21:11:53'),
(134, 'App\\Models\\User', 5, 'auth-token', 'bf5dfd4bd4f5479b0ea4892cd1800107fd39afd6779ae56325f61898e0485091', '[\"*\"]', '2026-05-04 21:12:39', NULL, '2026-05-04 21:12:08', '2026-05-04 21:12:39'),
(135, 'App\\Models\\User', 4, 'auth-token', '41fa4251d230281086e686f14dd1f20cf58c10476907f4330a708d32fb86c4a5', '[\"*\"]', '2026-05-04 21:14:04', NULL, '2026-05-04 21:12:48', '2026-05-04 21:14:04'),
(136, 'App\\Models\\User', 10, 'auth-token', '603481b1058dc53df32867b241b277f9cb1de11e40921357cd8090eaa76b9d90', '[\"*\"]', '2026-05-04 21:14:47', NULL, '2026-05-04 21:14:17', '2026-05-04 21:14:47'),
(137, 'App\\Models\\User', 8, 'auth-token', 'da7a0a1f9adcabe61c31018e93a6c91afcb1a74824f0de5c762da379ab61123b', '[\"*\"]', '2026-05-04 21:16:19', NULL, '2026-05-04 21:16:03', '2026-05-04 21:16:19'),
(138, 'App\\Models\\User', 2, 'auth-token', '74d79e7bf91376442bf383a2b18a6906f5906233b3c5d9261f70ac5a52636826', '[\"*\"]', '2026-05-04 21:17:48', NULL, '2026-05-04 21:16:32', '2026-05-04 21:17:48'),
(139, 'App\\Models\\User', 49, 'auth-token', 'f2ee2cdf75c07fb99e7d6b0126905227503495e22a132ac03c5238bd1bb139f0', '[\"*\"]', '2026-05-04 21:18:37', NULL, '2026-05-04 21:18:06', '2026-05-04 21:18:37'),
(140, 'App\\Models\\User', 76, 'auth-token', 'de88a0775dbe06f79c7c951cf0883e8807d97add5b1241ebc101bfd03d380973', '[\"*\"]', '2026-05-04 21:20:19', NULL, '2026-05-04 21:18:48', '2026-05-04 21:20:19'),
(141, 'App\\Models\\User', 75, 'auth-token', 'af06323c22415e5bdb20d758bb9284d5b47ee3c5e314ea2bb307c9e3b4a503da', '[\"*\"]', '2026-05-04 21:21:28', NULL, '2026-05-04 21:20:42', '2026-05-04 21:21:28'),
(142, 'App\\Models\\User', 72, 'auth-token', 'cf32cf4317e230f910a4cb10060039f1bd91c5d7e159f4242f097d84e5f52362', '[\"*\"]', '2026-05-04 21:23:05', NULL, '2026-05-04 21:21:47', '2026-05-04 21:23:05'),
(143, 'App\\Models\\User', 75, 'auth-token', '68a9db6616a390fafdb4acad08196e5d1d846db1273ec0606b9e575849ac49b3', '[\"*\"]', '2026-05-04 21:37:58', NULL, '2026-05-04 21:35:12', '2026-05-04 21:37:58'),
(144, 'App\\Models\\User', 7, 'auth-token', 'a8c4d3ed35d78272717100bb83adfa1c5234264c3c0281cef6c2177a83d3a4e9', '[\"*\"]', '2026-05-04 21:40:42', NULL, '2026-05-04 21:38:11', '2026-05-04 21:40:42'),
(145, 'App\\Models\\User', 5, 'auth-token', '52bc54799784f2fcb24cc68ddc81ceb93a89ee61c381f3a6553a6d251199e5ac', '[\"*\"]', '2026-05-04 21:42:16', NULL, '2026-05-04 21:40:57', '2026-05-04 21:42:16'),
(146, 'App\\Models\\User', 11, 'auth-token', '4ef8e472a4dbf9118dce911472aaa4b4432a0d134af92759f4b48b695ead2854', '[\"*\"]', '2026-05-04 21:43:46', NULL, '2026-05-04 21:42:31', '2026-05-04 21:43:46'),
(147, 'App\\Models\\User', 9, 'auth-token', '0910ded6c9ab3f70d0cce167e9ff14d76b64137d363f6d1ab1443a67842db14e', '[\"*\"]', '2026-05-04 21:45:20', NULL, '2026-05-04 21:43:55', '2026-05-04 21:45:20'),
(148, 'App\\Models\\User', 4, 'auth-token', '67f5a3d5abccc2967da731697d8ff5f058d2ae707637177250f268cd443f15b7', '[\"*\"]', '2026-05-04 21:47:45', NULL, '2026-05-04 21:45:59', '2026-05-04 21:47:45'),
(149, 'App\\Models\\User', 8, 'auth-token', '3aea71e636d9f701f06bdebfa6ad5b7a82cc29301827d1d7055998a9c99a8279', '[\"*\"]', '2026-05-04 21:50:34', NULL, '2026-05-04 21:48:03', '2026-05-04 21:50:34'),
(150, 'App\\Models\\User', 11, 'auth-token', 'f59691ebe8ac26ede51ef484bd4b54fcc1b35c9fab3bdd1fc4991f686d12ff0b', '[\"*\"]', '2026-05-04 21:52:19', NULL, '2026-05-04 21:50:47', '2026-05-04 21:52:19'),
(151, 'App\\Models\\User', 10, 'auth-token', 'a921004bc961702f4a6117b27302e8ef9e2c999d0ae8c9b8355130a4ec1ac22a', '[\"*\"]', '2026-05-04 21:56:37', NULL, '2026-05-04 21:52:36', '2026-05-04 21:56:37'),
(152, 'App\\Models\\User', 5, 'auth-token', '9da6ff114772f1d5727db3a20ca4edb9e0fab49f1cb4d27c183d3c727208bb18', '[\"*\"]', '2026-05-04 22:03:16', NULL, '2026-05-04 21:57:16', '2026-05-04 22:03:16'),
(153, 'App\\Models\\User', 76, 'auth-token', 'df93c32967b799610cbf6fe2f732803def40bec8c9bc877128c246d68efb62bf', '[\"*\"]', '2026-05-04 22:04:08', NULL, '2026-05-04 22:03:23', '2026-05-04 22:04:08'),
(154, 'App\\Models\\User', 75, 'auth-token', 'f9da03f75574b630ab8961fbb1a097ce7ead210a880634bd9da97f9c178cee6a', '[\"*\"]', '2026-05-04 22:04:41', NULL, '2026-05-04 22:04:26', '2026-05-04 22:04:41'),
(155, 'App\\Models\\User', 7, 'auth-token', '809ffa34e133cbe335e6428cd7cec8331352ed2bacc08a930dffa44f051c16d1', '[\"*\"]', '2026-05-04 22:06:10', NULL, '2026-05-04 22:05:09', '2026-05-04 22:06:10'),
(156, 'App\\Models\\User', 8, 'auth-token', 'ed1c5df38c7612493c916069bf32093a79d18f23cec28a35a198b7d26b7c9cb1', '[\"*\"]', '2026-05-04 22:06:23', NULL, '2026-05-04 22:06:23', '2026-05-04 22:06:23'),
(157, 'App\\Models\\User', 11, 'auth-token', '711b04ae5258339e29096d0d2ab0af863832f9528527a0e8fbd3ff4fccfa8b9b', '[\"*\"]', '2026-05-04 22:06:48', NULL, '2026-05-04 22:06:48', '2026-05-04 22:06:48'),
(158, 'App\\Models\\User', 5, 'auth-token', '34ef698d651c8a82c384f2a078c77ee33c397b26ee50f923953fffa7df5ff809', '[\"*\"]', '2026-05-04 22:07:33', NULL, '2026-05-04 22:07:03', '2026-05-04 22:07:33'),
(159, 'App\\Models\\User', 4, 'auth-token', 'd48ce472b7e3b87f1a066825ce3fccb5259f734998409097023984f90eff2a25', '[\"*\"]', '2026-05-04 22:07:50', NULL, '2026-05-04 22:07:49', '2026-05-04 22:07:50'),
(160, 'App\\Models\\User', 9, 'auth-token', '6b33ddc65099b3df408a9949b2bda363637863ed69aa7eda4a1901237629a31d', '[\"*\"]', '2026-05-04 22:08:34', NULL, '2026-05-04 22:08:03', '2026-05-04 22:08:34'),
(161, 'App\\Models\\User', 10, 'auth-token', 'b3d077d84731fd9b447ec76889634dfbf164c24c9576c35b59e34c35e68eaad2', '[\"*\"]', '2026-05-04 22:09:15', NULL, '2026-05-04 22:08:44', '2026-05-04 22:09:15'),
(162, 'App\\Models\\User', 76, 'auth-token', 'e3933875696731895ae004038bd1b425569def10eac5ca887ed9f26073ec346a', '[\"*\"]', '2026-05-04 22:10:05', NULL, '2026-05-04 22:09:34', '2026-05-04 22:10:05'),
(163, 'App\\Models\\User', 49, 'auth-token', '19aa96ab031e994ae855ce59b8d44eb8ccd1b31ee09708880d962322ac4af6f6', '[\"*\"]', '2026-05-04 22:14:10', NULL, '2026-05-04 22:11:24', '2026-05-04 22:14:10'),
(164, 'App\\Models\\User', 51, 'auth-token', '8c1b64c03578478774e6075c6d15957110afa7b239d5d847ace3664dc1e765b9', '[\"*\"]', '2026-05-04 22:18:37', NULL, '2026-05-04 22:14:36', '2026-05-04 22:18:37'),
(165, 'App\\Models\\User', 40, 'auth-token', '891693d74fec3bfecbb468b625b11ea6dacd50714724403a92e953243182ec09', '[\"*\"]', '2026-05-04 22:25:45', NULL, '2026-05-04 22:18:45', '2026-05-04 22:25:45'),
(166, 'App\\Models\\User', 2, 'auth-token', '60a08a2fec00c9133b909558a18d1d4cc7a317bdd685ebed905de98e4663b7a9', '[\"*\"]', '2026-05-05 00:15:40', NULL, '2026-05-04 22:26:10', '2026-05-05 00:15:40'),
(167, 'App\\Models\\User', 75, 'auth-token', '90e6b93d94076c2e3bab025c9fa1fc4fc0904e98cbe02f3e6cf8194b5166507d', '[\"*\"]', '2026-05-05 00:41:04', NULL, '2026-05-05 00:15:48', '2026-05-05 00:41:04'),
(168, 'App\\Models\\User', 2, 'auth-token', 'df109ddba6dde1df9d251e15465e51b532e8d89991dde09075faca62352099f5', '[\"*\"]', '2026-05-05 00:42:53', NULL, '2026-05-05 00:41:52', '2026-05-05 00:42:53'),
(169, 'App\\Models\\User', 7, 'auth-token', '4c0e97bfc7d638b6ad558a400a7bdf09c66ed0f7125192e7092d37d9ef50236b', '[\"*\"]', '2026-05-05 17:17:43', NULL, '2026-05-05 00:43:02', '2026-05-05 17:17:43'),
(170, 'App\\Models\\User', 75, 'auth-token', '09fa8e4f63904abd71b19e9b68d01faecde92731de29f427e6de7b7b13a61ece', '[\"*\"]', '2026-05-05 17:27:25', NULL, '2026-05-05 17:17:54', '2026-05-05 17:27:25'),
(171, 'App\\Models\\User', 75, 'auth-token', '30b3315d3b2383870c58e11ad6ab6e2855ac3e0a9ac6aa0bf1c663052fd7d807', '[\"*\"]', '2026-05-05 17:39:20', NULL, '2026-05-05 17:37:34', '2026-05-05 17:39:20'),
(172, 'App\\Models\\User', 76, 'auth-token', '000485ad0bc5d6734ac39222b207befacc0633443097e6f145c9de6ad5e384e8', '[\"*\"]', '2026-05-05 17:41:36', NULL, '2026-05-05 17:39:35', '2026-05-05 17:41:36'),
(173, 'App\\Models\\User', 72, 'auth-token', '097283668eddd71c3a690c0240788ec416d8fbae65b08d9f484a91a38f78e718', '[\"*\"]', '2026-05-05 17:43:03', NULL, '2026-05-05 17:41:55', '2026-05-05 17:43:03'),
(174, 'App\\Models\\User', 2, 'auth-token', '67da86d3761670c4b7a8440a44489c0ebb47320b895ab0b5a5aa583a0b83652e', '[\"*\"]', '2026-05-05 17:45:22', NULL, '2026-05-05 17:44:29', '2026-05-05 17:45:22'),
(175, 'App\\Models\\User', 75, 'auth-token', 'efdd3ad4e22070476e50baa7b5d3a95cd9074c29d2c3daf93eee4489809e0c54', '[\"*\"]', '2026-05-05 18:02:05', NULL, '2026-05-05 17:45:35', '2026-05-05 18:02:05'),
(176, 'App\\Models\\User', 2, 'auth-token', '6c1a1c464d97151bd3ce4615f09b5c73f548e9f94410bb857be556f6e1a0ad84', '[\"*\"]', '2026-05-05 18:08:34', NULL, '2026-05-05 18:02:18', '2026-05-05 18:08:34'),
(177, 'App\\Models\\User', 5, 'auth-token', '72e1059591280a2bfbc47f51e541128ae74b7d22660a279b3893ce51ee1b6214', '[\"*\"]', '2026-05-06 18:41:09', NULL, '2026-05-05 18:08:57', '2026-05-06 18:41:09'),
(178, 'App\\Models\\User', 21, 'auth-token', 'a80c11b1dcb80dbf2dd918d1ceac1ac7291c1f984a7a36189c0d827d42aff7f4', '[\"*\"]', '2026-05-07 19:37:15', NULL, '2026-05-06 02:38:07', '2026-05-07 19:37:15'),
(179, 'App\\Models\\User', 16, 'auth-token', '42d02894c72fc3c4a600812315d2bfc064d3cb2a774028e739cccf0766c20dfb', '[\"*\"]', '2026-05-07 00:47:29', NULL, '2026-05-06 02:56:39', '2026-05-07 00:47:29'),
(180, 'App\\Models\\User', 19, 'auth-token', '0afb7a7c4e852f0f0b2a0efce8153a6dbbd6ccd4cda46bc131849ae4381b909b', '[\"*\"]', '2026-05-06 08:00:51', NULL, '2026-05-06 07:38:53', '2026-05-06 08:00:51'),
(181, 'App\\Models\\User', 68, 'auth-token', '4dfef612389fd0ffc4493a0c0a213c0f77a210bc498fcc3b51e33f501899112e', '[\"*\"]', '2026-05-06 17:28:24', NULL, '2026-05-06 17:27:08', '2026-05-06 17:28:24'),
(182, 'App\\Models\\User', 75, 'auth-token', '8d89aac393402a88d7bda402a7153c49d0d7a9c100f95dd5d396ff7069b2b875', '[\"*\"]', '2026-05-10 05:56:26', NULL, '2026-05-07 19:29:18', '2026-05-10 05:56:26'),
(183, 'App\\Models\\User', 32, 'auth-token', '0774e1d66e12c220ea62a3e4306df02802a1155720aba237f9706dafec454897', '[\"*\"]', '2026-05-07 20:47:51', NULL, '2026-05-07 20:33:51', '2026-05-07 20:47:51'),
(184, 'App\\Models\\User', 14, 'auth-token', '790de031daa2ae6e20f520bdfd134ee8d837c011c5acfe75db7b1038e7d7d578', '[\"*\"]', '2026-05-07 20:50:18', NULL, '2026-05-07 20:49:48', '2026-05-07 20:50:18'),
(185, 'App\\Models\\User', 65, 'auth-token', '5de9aa3853ddcfcc6333d3883ee45bf2d02468d006ec418df51aa06966572a07', '[\"*\"]', '2026-05-12 20:16:53', NULL, '2026-05-08 00:01:12', '2026-05-12 20:16:53'),
(186, 'App\\Models\\User', 75, 'auth-token', '0437efb7e7752de001dab83568f38ddb98907d141aeb439cfdf0c4401ab248cb', '[\"*\"]', '2026-05-10 06:04:57', NULL, '2026-05-10 05:56:42', '2026-05-10 06:04:57'),
(187, 'App\\Models\\User', 76, 'auth-token', '269adfe895475f4bf0f58a40b1e3c165db6a16c9acd4bbf3cdb84442c65267f1', '[\"*\"]', '2026-05-10 06:05:48', NULL, '2026-05-10 06:05:33', '2026-05-10 06:05:48'),
(188, 'App\\Models\\User', 76, 'auth-token', 'b01bfd0291557ee34423896a4c603669144ef41faea36b8429959a38dd489888', '[\"*\"]', '2026-05-10 06:06:03', NULL, '2026-05-10 06:05:59', '2026-05-10 06:06:03'),
(189, 'App\\Models\\User', 77, 'auth-token', '0a247a74c877f7b4687dcc3a607152b4c1baa323137cdc7bbac8b388261d86bc', '[\"*\"]', '2026-05-10 06:07:29', NULL, '2026-05-10 06:06:13', '2026-05-10 06:07:29'),
(190, 'App\\Models\\User', 76, 'auth-token', '1cdee2f3696f9034088e3bdbe9809baed1135639e7cfedd7ca3c50aec1b8c20e', '[\"*\"]', '2026-05-10 06:08:29', NULL, '2026-05-10 06:07:40', '2026-05-10 06:08:29'),
(191, 'App\\Models\\User', 77, 'auth-token', 'c436074b616023050cd7b59f533c2ccd00d37fb525cc93e9973e0f65c98953df', '[\"*\"]', '2026-05-10 17:37:59', NULL, '2026-05-10 06:08:35', '2026-05-10 17:37:59'),
(192, 'App\\Models\\User', 2, 'auth-token', '034fd521f659c84d55a478bcc90921e203be6d2923315bdd0a2b3465b0b359d8', '[\"*\"]', '2026-05-10 19:00:31', NULL, '2026-05-10 17:38:15', '2026-05-10 19:00:31'),
(193, 'App\\Models\\User', 75, 'auth-token', '88165062041e540a5f5ebd9029684aa9e173b24b3535a2b35f5ff59d304926fb', '[\"*\"]', '2026-05-10 19:06:22', NULL, '2026-05-10 19:04:52', '2026-05-10 19:06:22'),
(194, 'App\\Models\\User', 65, 'auth-token', '8395746f87d60a2da14cbbd8413b2c224d2fc68b6a11d08b5c71844b193cb3b4', '[\"*\"]', '2026-05-10 19:13:50', NULL, '2026-05-10 19:09:46', '2026-05-10 19:13:50'),
(195, 'App\\Models\\User', 72, 'auth-token', 'f9a00d5c49321b91746b4e0891b799c89c05eea535ab9149027d6805e0dbefd0', '[\"*\"]', '2026-05-10 19:14:19', NULL, '2026-05-10 19:14:18', '2026-05-10 19:14:19'),
(196, 'App\\Models\\User', 65, 'auth-token', '8680a5aadb3cde7cd048e85c633b796085e4be07c6da9aec7b70c7a5092b8818', '[\"*\"]', '2026-05-12 17:57:19', NULL, '2026-05-10 19:41:17', '2026-05-12 17:57:19'),
(197, 'App\\Models\\User', 72, 'auth-token', 'b4998c6acf4102f22e422b6cd3231029738d0f75c4f22be5f53a87abb1068804', '[\"*\"]', '2026-05-12 18:00:27', NULL, '2026-05-12 17:57:43', '2026-05-12 18:00:27'),
(198, 'App\\Models\\User', 30, 'auth-token', 'f484c4db87923caac8ea02f9c198befbb255b61c1c90b2da57addbe002536125', '[\"*\"]', '2026-05-14 01:48:26', NULL, '2026-05-12 20:13:57', '2026-05-14 01:48:26');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `plans`
--

CREATE TABLE `plans` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `code` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `month` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `department_id` bigint(20) UNSIGNED NOT NULL,
  `status` varchar(255) NOT NULL DEFAULT 'DRAFT',
  `score` int(11) DEFAULT NULL,
  `feedback` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `attached_file_path` varchar(255) DEFAULT NULL,
  `attached_file_name` varchar(255) DEFAULT NULL,
  `attachments` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`attachments`))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `plans`
--

INSERT INTO `plans` (`id`, `code`, `title`, `month`, `year`, `user_id`, `department_id`, `status`, `score`, `feedback`, `created_at`, `updated_at`, `attached_file_path`, `attached_file_name`, `attachments`) VALUES
(27, 'KH-2026-0026', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 75, 4, 'SUBMITTED', NULL, NULL, '2026-05-04 21:35:28', '2026-05-04 22:04:41', NULL, NULL, '[]'),
(28, 'KH-2026-0028', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 7, 4, 'SUBMITTED', NULL, NULL, '2026-05-04 21:38:20', '2026-05-04 22:06:03', NULL, NULL, '[]'),
(30, 'KH-2026-0030', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 5, 4, 'SUBMITTED', NULL, NULL, '2026-05-04 21:41:07', '2026-05-04 22:07:30', NULL, NULL, '[]'),
(31, 'KH-2026-0031', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 9, 4, 'SUBMITTED', NULL, NULL, '2026-05-04 21:44:10', '2026-05-04 22:08:29', NULL, NULL, '[]'),
(32, 'KH-2026-0032', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 4, 4, 'SUBMITTED', NULL, NULL, '2026-05-04 21:46:05', '2026-05-04 21:47:37', NULL, NULL, '[]'),
(33, 'KH-2026-0033', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 8, 4, 'SUBMITTED', NULL, NULL, '2026-05-04 21:49:03', '2026-05-04 21:50:08', NULL, NULL, '[]'),
(34, 'KH-2026-0034', 'Kế hoạch công tác tháng 5/2026', 5, 2026, 11, 4, 'DRAFT', NULL, NULL, '2026-05-04 21:50:54', '2026-05-04 21:50:54', NULL, NULL, '[]'),
(35, 'KH-2026-0035', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 11, 4, 'SUBMITTED', NULL, NULL, '2026-05-04 21:51:10', '2026-05-04 21:52:07', NULL, NULL, '[]'),
(36, 'KH-2026-0036', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 10, 4, 'SUBMITTED', NULL, NULL, '2026-05-04 21:52:43', '2026-05-04 21:53:49', NULL, NULL, '[]'),
(38, 'KH-2026-0037', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 49, 1, 'SUBMITTED', NULL, NULL, '2026-05-04 22:11:34', '2026-05-04 22:13:46', NULL, NULL, '[]'),
(39, 'KH-2026-0039', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 51, 1, 'SUBMITTED', NULL, NULL, '2026-05-04 22:14:51', '2026-05-04 22:17:03', NULL, NULL, '[]'),
(40, 'KH-2026-0040', 'Kế hoạch công tác tháng 4/2026', 5, 2026, 40, 2, 'COMPLETED', NULL, NULL, '2026-05-04 22:18:47', '2026-05-04 22:25:28', NULL, NULL, '[]'),
(44, 'KH-2026-0041', 'Kế hoạch công tác tháng 5/2026', 5, 2026, 75, 4, 'COMPLETED', NULL, NULL, '2026-05-05 17:19:42', '2026-05-05 17:21:23', NULL, NULL, '[]'),
(45, 'KH-2026-0045', 'Kế hoạch công tác tháng 5/2026', 5, 2026, 75, 4, 'DRAFT', NULL, NULL, '2026-05-05 17:45:39', '2026-05-05 17:45:39', NULL, NULL, '[]'),
(46, 'KH-2026-0046', 'KH khai thác thiết bị tháng 5-2026', 5, 2026, 32, 2, 'DRAFT', NULL, NULL, '2026-05-07 20:35:46', '2026-05-07 20:35:46', 'plans/4zuqO34SVCF55gurW22Np89p1gxr4LThXw6aIrNT.pdf', 'KH khai thác thiết bị tháng 5-2026.pdf', '[{\"name\":\"KH khai th\\u00e1c thi\\u1ebft b\\u1ecb th\\u00e1ng 5-2026.pdf\",\"path\":\"plans\\/4zuqO34SVCF55gurW22Np89p1gxr4LThXw6aIrNT.pdf\"}]'),
(47, 'KH-2026-0047', 'KH khai thác thiết bị tháng 5-2026', 5, 2026, 32, 2, 'DEPT_APPROVED_TO_BGH', NULL, NULL, '2026-05-07 20:36:57', '2026-05-07 20:50:14', 'plans/qVzRpTY6ulOEaEvtR3BpUYNEwX8GxP8Mg4RhfzQG.pdf', 'KH khai thác thiết bị tháng 5-2026.pdf', '[{\"name\":\"KH khai th\\u00e1c thi\\u1ebft b\\u1ecb th\\u00e1ng 5-2026.pdf\",\"path\":\"plans\\/qVzRpTY6ulOEaEvtR3BpUYNEwX8GxP8Mg4RhfzQG.pdf\",\"url\":\"\\/api\\/storage\\/plans\\/qVzRpTY6ulOEaEvtR3BpUYNEwX8GxP8Mg4RhfzQG.pdf\"}]'),
(48, 'KH-2026-0048', 'KH KHAI THAC TB THANG 5.2026 BM TĐH', 5, 2026, 65, 1, 'SUBMITTED', NULL, NULL, '2026-05-08 00:06:05', '2026-05-08 00:12:46', 'plans/ijJaT1zgLmp72Uup0a0o36Q93RZdcNOcvbbrmDxR.docx', 'KH KHAI THAC TB THANG 5.2026 BM TĐH.docx', '[{\"name\":\"KH KHAI THAC TB THANG 5.2026 BM T\\u0110H.docx\",\"path\":\"plans\\/ijJaT1zgLmp72Uup0a0o36Q93RZdcNOcvbbrmDxR.docx\",\"url\":\"\\/api\\/storage\\/plans\\/ijJaT1zgLmp72Uup0a0o36Q93RZdcNOcvbbrmDxR.docx\"}]'),
(49, 'KH-2026-0049', 'Kế hoạch công tác tháng 6/2026', 6, 2026, 75, 4, 'DRAFT', NULL, NULL, '2026-05-10 05:59:00', '2026-05-10 05:59:00', NULL, NULL, '[]'),
(50, 'KH-2026-0050', 'Kế hoạch công tác tháng 3/2026', 3, 2026, 75, 4, 'DRAFT', NULL, NULL, '2026-05-10 06:03:28', '2026-05-10 06:03:28', NULL, NULL, '[]'),
(51, 'KH-2026-0051', 'Kế hoạch công tác tháng 6/2026', 6, 2026, 75, 4, 'DRAFT', NULL, NULL, '2026-05-10 06:04:25', '2026-05-10 06:04:25', NULL, NULL, '[]'),
(52, 'KH-2026-0052', 'Kế hoạch công tác tháng 5/2026', 5, 2026, 77, 4, 'DEPT_APPROVED_TO_BGH', NULL, NULL, '2026-05-10 06:06:23', '2026-05-10 06:07:47', NULL, NULL, '[]'),
(53, 'KH-2026-0053', 'KH KT thang 05.2026', 5, 2026, 30, 5, 'SUBMITTED', NULL, NULL, '2026-05-12 20:15:52', '2026-05-12 20:23:30', 'plans/Ghzq7PxXakNzGc7UlA8KRvnAoDSTFof80q3mhUZJ.docx', 'KH KT thang 05.2026.docx', '[{\"name\":\"KH KT thang 05.2026.docx\",\"path\":\"plans\\/gLfiPSEAjTpWb1QseOOeiqlYJTAXPalnpUQmT1Ex.docx\",\"url\":\"\\/api\\/storage\\/plans\\/gLfiPSEAjTpWb1QseOOeiqlYJTAXPalnpUQmT1Ex.docx\"},{\"name\":\"KH KT thang 05.2026.docx\",\"path\":\"plans\\/Ghzq7PxXakNzGc7UlA8KRvnAoDSTFof80q3mhUZJ.docx\",\"url\":\"\\/api\\/storage\\/plans\\/Ghzq7PxXakNzGc7UlA8KRvnAoDSTFof80q3mhUZJ.docx\"}]');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `plan_items`
--

CREATE TABLE `plan_items` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `plan_id` bigint(20) UNSIGNED NOT NULL,
  `topic` varchar(255) NOT NULL,
  `location_id` bigint(20) UNSIGNED DEFAULT NULL,
  `equipment_id` bigint(20) UNSIGNED DEFAULT NULL,
  `equipment_name_manual` varchar(255) DEFAULT NULL,
  `equipment_year_manual` int(11) DEFAULT NULL,
  `executor_id` bigint(20) UNSIGNED DEFAULT NULL,
  `mentor_id` bigint(20) UNSIGNED DEFAULT NULL,
  `time_range` varchar(255) DEFAULT NULL,
  `expected_result` text DEFAULT NULL,
  `planned_hours` int(11) NOT NULL DEFAULT 0,
  `type` varchar(255) NOT NULL DEFAULT 'TEACHER',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `plan_items`
--

INSERT INTO `plan_items` (`id`, `plan_id`, `topic`, `location_id`, `equipment_id`, `equipment_name_manual`, `equipment_year_manual`, `executor_id`, `mentor_id`, `time_range`, `expected_result`, `planned_hours`, `type`, `created_at`, `updated_at`) VALUES
(56, 32, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"X\\u00e2y d\\u1ef1ng c\\u00e1c h\\u1ec7 th\\u1ed1ng IoT v\\u1edbi Raspberry Pi\\n\",\"dia_diem\":\"205X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"- H\\u01b0\\u1edbng d\\u1eabn c\\u00e1ch thi\\u1ebft k\\u1ebf h\\u1ec7 th\\u1ed1ng v\\u1edbi Raspberry Pi.\\n- H\\u01b0\\u1edbng d\\u1eabn t\\u00edch h\\u1ee3p AI, th\\u1ecb gi\\u00e1c m\\u00e1y t\\u00ednh v\\u1edbi h\\u1ec7 th\\u1ed1ng c\\u00f3 Raspberry Pi.\\n- H\\u1ec7 th\\u1ed1ng b\\u00e0i th\\u1ef1c h\\u00e0nh cho h\\u1ecdc ph\\u1ea7n - Ph\\u00e1t tri\\u1ec3n \\u1ee9ng d\\u1ee5ng IoT, Th\\u1ecb gi\\u00e1c m\\u00e1y t\\u00ednh.\\n\"}', 0, 'TEACHER', '2026-05-04 21:47:37', '2026-05-04 21:47:37'),
(58, 33, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"Nghi\\u00ean c\\u1ee9u vai tr\\u00f2 c\\u1ee7a Wireless LAN Controller (WLC) trong qu\\u1ea3n tr\\u1ecb m\\u1ea1ng kh\\u00f4ng d\\u00e2y tr\\u00ean Switch 2960\",\"dia_diem\":\"203X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"- C\\u1ea5u h\\u00ecnh Switch cisco 2960\\n- Join c\\u00e1c h\\u1ec7 th\\u1ed1ng Access Point v\\u00e0o Switch\\n- Ping c\\u00e1c k\\u1ebft n\\u1ed1i trong h\\u1ec7 th\\u1ed1ng\"}', 0, 'TEACHER', '2026-05-04 21:50:07', '2026-05-04 21:50:07'),
(59, 34, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '[]', 0, 'TEACHER', '2026-05-04 21:50:54', '2026-05-04 21:50:54'),
(61, 35, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"C\\u1ea5u h\\u00ecnh \\u0111\\u1ecbnh tuy\\u1ebfn OSPF \\u0111\\u01a1n v\\u00f9ng tr\\u00ean router cisco\",\"dia_diem\":\"203X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"Hi\\u1ec3u nguy\\u00ean l\\u00fd \\u0111\\u1ecbnh tuy\\u1ebfn \\u0111\\u1ed9ng tr\\u00ean - router\\n- C\\u1ea5u h\\u00ecnh OSPF Area 0\\n- Ki\\u1ec3m tra v\\u00e0 ph\\u00e2n t\\u00edch b\\u1ea3ng \\u0111\\u1ecbnh tuy\\u1ebfn\"}', 0, 'TEACHER', '2026-05-04 21:52:06', '2026-05-04 21:52:06'),
(63, 36, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"Nghi\\u00ean c\\u1ee9u x\\u00e2y d\\u1ef1ng \\u1ee9ng d\\u1ee5ng h\\u1ed7 tr\\u1ee3 chuy\\u1ec3n \\u0111\\u1ed5i s\\u1ed1 c\\u00e1c th\\u1ee7 t\\u1ee5c quy tr\\u00ecnh c\\u1ee7a Tr\\u01b0\\u1eddng \\u0110\\u1ea1i h\\u1ecdc Sao \\u0110\\u1ecf\",\"dia_diem\":\"205X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"- L\\u1eadp tr\\u00ecnh ph\\u1ea7n m\\u1ec1m, ho\\u00e0n thi\\u1ec7n c\\u00e1c ch\\u1ee9c n\\u0103ng\\n- Th\\u1eed nghi\\u1ec7m \\u1ee9ng d\\u1ee5ng\"}', 0, 'TEACHER', '2026-05-04 21:53:48', '2026-05-04 21:53:48'),
(67, 27, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"Nghi\\u00ean c\\u1ee9u ph\\u00e1t tri\\u1ec3n \\u1ee9ng d\\u1ee5ng \\u0111a n\\u1ec1n t\\u1ea3ng, x\\u00e2y d\\u1ef1ng \\u1ee9ng d\\u1ee5ng logistics cho c\\u00f4ng ty v\\u1eadn chuy\\u1ec3n\",\"dia_diem\":\"202X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"- Thi\\u1ebft k\\u1ebf giao di\\u1ec7n \\n- Thi\\u1ebft k\\u1ebf ch\\u1ee9c n\\u0103ng\\n- Th\\u1eed nghi\\u1ec7m \\u1ee9ng d\\u1ee5ng\\n\"}', 0, 'TEACHER', '2026-05-04 22:04:41', '2026-05-04 22:04:41'),
(69, 30, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"Ph\\u00e1t hi\\u1ec7n v\\u00e0 hi\\u1ec7u ch\\u1ec9nh \\u1ea3nh t\\u00e0i li\\u1ec7u b\\u1ecb nghi\\u00eang\",\"dia_diem\":\"202X4\",\"ten_thiet_bi\":\"Ma\\u0301y ti\\u0301nh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"- Nghi\\u00ean c\\u1ee9u c\\u00e1c k\\u1ef9 thu\\u1eadt tr\\u00edch ch\\u1ecdn \\u0111\\u1eb7c tr\\u01b0ng n\\u00e2ng cao.\\n- Match v\\u1edbi template t\\u00e0i li\\u1ec7u chu\\u1ea9n.\\n- X\\u00e2y d\\u1ef1ng \\u1ee9ng d\\u1ee5ng ph\\u00e1t hi\\u1ec7n v\\u00e0 hi\\u1ec7u ch\\u1ec9nh t\\u00e0i li\\u1ec7u\\n\"}', 0, 'TEACHER', '2026-05-04 22:07:30', '2026-05-04 22:07:30'),
(70, 30, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"tableType\":\"student\",\"tt\":\"\",\"chu_de\":\"X\\u00e2y d\\u1ef1ng giao di\\u1ec7n \\u1ee9ng d\\u1ee5ng truy xu\\u1ea5t ngu\\u1ed3n g\\u1ed1c v\\u0103n b\\u1eb1ng\",\"dia_diem\":\"203X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"sinh_vien\":\"\\u0110o\\u00e0n M\\u1ea1nh T\\u00fa\",\"giang_vien\":\"\",\"ket_qua\":\"- Thi\\u1ebft k\\u1ebf Form nh\\u1eadp m\\u00e3\\n- QR code scan\\n- Hi\\u1ec3n th\\u1ecb k\\u1ebft qu\\u1ea3\",\"plannedHours\":0}', 0, 'TEACHER', '2026-05-04 22:07:30', '2026-05-04 22:07:30'),
(71, 31, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"Nghi\\u00ean c\\u1ee9u thi\\u1ebft k\\u1ebf h\\u1ec7 th\\u1ed1ng gi\\u00e1m s\\u00e1t c\\u1ea3nh b\\u00e1o ch\\u00e1y kh\\u00f4ng ph\\u00f2ng th\\u1ef1c h\\u00e0nh\",\"dia_diem\":\"203X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"- H\\u01b0\\u1edbng d\\u1eabn s\\u1eed d\\u1ee5ng c\\u1ea3m bi\\u1ebfn nhi\\u1ec7t \\u0111\\u1ed9\\n- Giao di\\u1ec7n ng\\u01b0\\u1eddi d\\u00f9ng\\n- Logic \\u0111i\\u1ec1u khi\\u1ec3n v\\u00e0 v\\u1eadn h\\u00e0nh\"}', 0, 'TEACHER', '2026-05-04 22:08:29', '2026-05-04 22:08:29'),
(74, 38, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"L\\u1eadp tr\\u00ecnh PID \\u1ed5n \\u0111\\u1ecbnh m\\u1ee9c n\\u01b0\\u1edbc\",\"dia_diem\":\"P.108X1\",\"ten_thiet_bi\":\"B\\u00e0n th\\u1ef1c h\\u00e0nh \\u0111i\\u1ec1u khi\\u1ec3n \\u1ed5n \\u0111\\u1ecbnh m\\u1ee9c d\\u00f9ng gi\\u1ea3i thu\\u1eadt PID\",\"nam_su_dung\":\"2017\",\"ket_qua\":\"- L\\u1eadp tr\\u00ecnh \\u0111\\u01b0\\u1ee3c ch\\u01b0\\u01a1ng tr\\u00ecnh \\u0111i\\u1ec1u khi\\u1ec3n\\n- \\u0110\\u1ea5u n\\u1ed1i, v\\u1eadn h\\u00e0nh \\u0111\\u01b0\\u1ee3c thi\\u1ebft b\\u1ecb\"}', 0, 'TEACHER', '2026-05-04 22:13:46', '2026-05-04 22:13:46'),
(76, 39, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"ket_qua\":\"- L\\u1eadp tr\\u00ecnh \\u0111\\u01b0\\u1ee3c ch\\u01b0\\u01a1ng tr\\u00ecnh \\u0111i\\u1ec1u khi\\u1ec3n\\n- \\u0110\\u1ea5u n\\u1ed1i, v\\u1eadn h\\u00e0nh \\u0111\\u01b0\\u1ee3c thi\\u1ebft b\\u1ecb\",\"nam_su_dung\":\"2017\",\"ten_thiet_bi\":\"B\\u00e0n th\\u1ef1c h\\u00e0nh \\u0111i\\u1ec1u khi\\u1ec3n \\u1ed5n \\u0111\\u1ecbnh m\\u1ee9c d\\u00f9ng gi\\u1ea3i thu\\u1eadt PID\",\"chu_de\":\"L\\u1eadp tr\\u00ecnh PID \\u1ed5n \\u0111\\u1ecbnh m\\u1ee9c n\\u01b0\\u1edbc\",\"dia_diem\":\"P.108X1\"}', 0, 'TEACHER', '2026-05-04 22:17:02', '2026-05-04 22:17:02'),
(79, 40, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"Nghi\\u00ean c\\u1ee9u Robot H\\u00e0n AX-V6\",\"dia_diem\":\"X\\u01b0\\u1edfng th\\u1ef1c t\\u1eadp h\\u00e0n X3\",\"ten_thiet_bi\":\"Robot h\\u00e0n AX-V6\",\"nam_su_dung\":\"2005\",\"ket_qua\":\"- H\\u01b0\\u1edbng d\\u1eabn sinh vi\\u00ean l\\u00e0m \\u0111\\u1ec1 t\\u00e0i\\n- L\\u1eadp tr\\u00ecnh h\\u00e0n \\u0111\\u01b0\\u1eddng \\u1ed1ng quay\"}', 0, 'TEACHER', '2026-05-04 22:23:09', '2026-05-04 22:23:09'),
(83, 28, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"Ph\\u00e2n t\\u00edch c\\u1ea3m x\\u00fac t\\u1eeb d\\u1eef li\\u1ec7u m\\u1ea1ng x\\u00e3 h\\u1ed9i theo th\\u1eddi gian th\\u1ef1c\",\"dia_diem\":\"202X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"- Thi\\u1ebft l\\u1eadp \\u0111\\u01b0\\u1ee3c m\\u00f4i tr\\u01b0\\u1eddng l\\u00e0m vi\\u1ec7c.\\n- L\\u00e0m s\\u1ea1ch d\\u1eef li\\u1ec7u v\\u00e0 s\\u1eed d\\u1ee5ng m\\u00f4 h\\u00ecnh Machine Learning.\\n- L\\u01b0u tr\\u1eef v\\u00e0 ph\\u00e2n t\\u00edch \\u0111\\u01b0\\u1ee3c d\\u1eef li\\u1ec7u c\\u1ea3m x\\u00fac.\\n- Tr\\u1ef1c quan h\\u00f3a: Hi\\u1ec3n th\\u1ecb bi\\u1ec3u \\u0111\\u1ed3 t\\u1ec9 l\\u1ec7 c\\u1ea3m x\\u00fac thay \\u0111\\u1ed5i theo th\\u1eddi gian.\\n\"}', 0, 'TEACHER', '2026-05-05 00:43:19', '2026-05-05 00:43:19'),
(85, 44, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"plannedHours\":0,\"chu_de\":\"X\\u00e2y d\\u1ef1ng h\\u1ec7 th\\u1ed1ng th\\u01b0\\u01a1ng m\\u1ea1i \\u0111i\\u1ec7n t\\u1eed cho s\\u1ea3n ph\\u1ea9m OCOP H\\u1ea3i Ph\\u00f2ng theo ki\\u1ebfn tr\\u00fac microservices\",\"dia_diem\":\"202X4\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2025\",\"ket_qua\":\"-- Nghi\\u00ean c\\u1ee9u ki\\u1ebfn tr\\u00fac microservices.\\n- X\\u00e2y d\\u1ef1ng h\\u1ec7 th\\u1ed1ng th\\u01b0\\u01a1ng m\\u1ea1i \\u0111i\\u1ec7n t\\u1eeb theo ki\\u1ebfn tr\\u00fac microservices\\n\"}', 0, 'TEACHER', '2026-05-05 17:21:14', '2026-05-05 17:21:14'),
(86, 45, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '[]', 0, 'TEACHER', '2026-05-05 17:45:39', '2026-05-05 17:45:39'),
(87, 46, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"chu_de\":\"K\\u1ebf ho\\u1ea1ch c\\u00f4ng vi\\u1ec7c 1 (d\\u1eef li\\u1ec7u m\\u1eabu t\\u1eeb file)\",\"plannedHours\":10,\"actualHours\":0,\"ket_qua\":\"Ho\\u00e0n th\\u00e0nh 100%\",\"status\":\"PENDING\"}', 10, 'TEACHER', '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(88, 46, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"chu_de\":\"K\\u1ebf ho\\u1ea1ch c\\u00f4ng vi\\u1ec7c 2 (d\\u1eef li\\u1ec7u m\\u1eabu t\\u1eeb file)\",\"plannedHours\":15,\"actualHours\":0,\"ket_qua\":\"Ho\\u00e0n th\\u00e0nh 100%\",\"status\":\"PENDING\"}', 15, 'TEACHER', '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(89, 46, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"chu_de\":\"H\\u1ecdp giao ban v\\u00e0 b\\u00e1o c\\u00e1o chuy\\u00ean \\u0111\\u1ec1\",\"plannedHours\":8,\"actualHours\":0,\"ket_qua\":\"Ho\\u00e0n th\\u00e0nh b\\u1ea3n th\\u1ea3o\",\"status\":\"PENDING\"}', 8, 'TEACHER', '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(99, 47, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":10,\"type\":\"TEACHER\",\"chu_de\":\"K\\u1ee8ng d\\u1ee5ng logic m\\u1edd v\\u00e0 tr\\u00ed tu\\u1ec7 nh\\u00e2n t\\u1ea1o trong x\\u00e2y d\\u1ef1ng c\\u00f4ng c\\u1ee5 h\\u1ed7 tr\\u1ee3 vi\\u1ebft v\\u00e0 ki\\u1ec3m tra tr\\u00f9ng l\\u1eb7p n\\u1ed9i dung khoa h\\u1ecdc.\",\"plannedHours\":10,\"actualHours\":0,\"ket_qua\":\"- Nghi\\u00ean c\\u1ee9u v\\u00e0 x\\u00e2y d\\u1ef1ng m\\u00f4 h\\u00ecnh \\u1ee9ng d\\u1ee5ng logic m\\u1edd v\\u00e0 tr\\u00ed tu\\u1ec7 nh\\u00e2n t\\u1ea1o trong ph\\u00e1t tri\\u1ec3n c\\u00f4ng c\\u1ee5 h\\u1ed7 tr\\u1ee3 vi\\u1ebft c\\u00e2u, \\u0111o\\u1ea1n v\\u0103n nh\\u1eb1m gi\\u1ea3m tr\\u00f9ng l\\u1eb7p n\\u1ed9i dung trong c\\u00e1c b\\u00e1o c\\u00e1o khoa h\\u1ecdc. \\n- \\u0110\\u1ec1 xu\\u1ea5t gi\\u1ea3i ph\\u00e1p n\\u00e2ng cao ch\\u1ea5t l\\u01b0\\u1ee3ng vi\\u1ebft h\\u1ecdc thu\\u1eadt v\\u00e0 h\\u1ea1n ch\\u1ebf \\u0111\\u1ea1o v\\u0103n trong nghi\\u00ean c\\u1ee9u.\\n\",\"status\":\"PENDING\",\"dia_diem\":\"101-X3\",\"ten_thiet_bi\":\"M\\u00e1y t\\u00ednh\",\"nam_su_dung\":\"2021\"}', 10, 'TEACHER', '2026-05-07 20:46:55', '2026-05-07 20:46:55'),
(109, 52, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"tableType\":\"teacher\",\"tt\":\"\",\"chu_de\":\"d\\u00e8\",\"dia_diem\":\"fd\",\"ten_thiet_bi\":\"fdf\",\"nam_su_dung\":\"4\",\"giang_vien\":\"test\",\"ket_qua\":\"fd\\nf\"}', 0, 'TEACHER', '2026-05-10 06:07:28', '2026-05-10 06:07:28'),
(113, 48, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":10,\"type\":\"TEACHER\",\"chu_de\":\"K\\u1ebf ho\\u1ea1ch c\\u00f4ng vi\\u1ec7c 1 (d\\u1eef li\\u1ec7u m\\u1eabu t\\u1eeb file)\",\"plannedHours\":10,\"actualHours\":0,\"ket_qua\":\"Ho\\u00e0n th\\u00e0nh 100%\",\"status\":\"PENDING\",\"dia_diem\":\"102X1\",\"ten_thiet_bi\":\"B\\u00e0n \\u0111\\u00e0o t\\u1ea1o PLC n\\u00e2ng cao, PLC Mitshubishi\",\"nam_su_dung\":\"2017\"}', 10, 'TEACHER', '2026-05-12 20:15:58', '2026-05-12 20:15:58'),
(114, 48, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":15,\"type\":\"TEACHER\",\"chu_de\":\"K\\u1ebf ho\\u1ea1ch c\\u00f4ng vi\\u1ec7c 2 (d\\u1eef li\\u1ec7u m\\u1eabu t\\u1eeb file)\",\"plannedHours\":15,\"actualHours\":0,\"ket_qua\":\"Ho\\u00e0n th\\u00e0nh 100%\",\"status\":\"PENDING\",\"dia_diem\":\"102x1\",\"ten_thiet_bi\":\"B\\u00e0n \\u0111\\u00e0o t\\u1ea1o PLC n\\u00e2ng cao, PLC Mitshubishi\",\"nam_su_dung\":\"2017\"}', 15, 'TEACHER', '2026-05-12 20:15:58', '2026-05-12 20:15:58'),
(115, 48, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":8,\"type\":\"TEACHER\",\"chu_de\":\"H\\u1ecdp giao ban v\\u00e0 b\\u00e1o c\\u00e1o chuy\\u00ean \\u0111\\u1ec1\",\"plannedHours\":8,\"actualHours\":0,\"ket_qua\":\"Ho\\u00e0n th\\u00e0nh b\\u1ea3n th\\u1ea3o\",\"status\":\"PENDING\"}', 8, 'TEACHER', '2026-05-12 20:15:58', '2026-05-12 20:15:58'),
(120, 53, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":10,\"type\":\"TEACHER\",\"chu_de\":\"Ki\\u1ec3m tra, b\\u1ea3o d\\u01b0\\u1ee1ng h\\u1ec7 th\\u1ed1ng \\u0111i\\u1ec1u h\\u00f2a xe Vinfast VF8\",\"plannedHours\":10,\"actualHours\":0,\"ket_qua\":\"Ho\\u00e0n th\\u00e0nh 100%\",\"status\":\"PENDING\",\"dia_diem\":\"x2\",\"ten_thiet_bi\":\"- Xe Vinfast VF8\\n- M\\u00e1y h\\u00fat ch\\u00e2n kh\\u00f4ng\\n- B\\u1ed9 \\u0111\\u1ed3ng h\\u1ed3 \\u0111o \\u00e1p su\\u1ea5t ga l\\u1ea1nh\",\"nam_su_dung\":\"2026\"}', 10, 'TEACHER', '2026-05-12 20:23:30', '2026-05-12 20:23:30'),
(121, 53, 'N/A', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '{\"topic\":\"N\\/A\",\"location_id\":null,\"equipment_id\":null,\"equipment_name_manual\":null,\"equipment_year_manual\":null,\"executor_id\":null,\"mentor_id\":null,\"time_range\":null,\"planned_hours\":0,\"type\":\"TEACHER\",\"tableType\":\"student\",\"tt\":\"\",\"chu_de\":\"Ki\\u1ec3m tra, b\\u1ea3o d\\u01b0\\u1ee1ng h\\u1ec7 th\\u1ed1ng \\u0111i\\u1ec1u h\\u00f2a xe Vinfast VF8\",\"dia_diem\":\"X2\",\"ten_thiet_bi\":\"- Xe Vinfast VF8\\n- M\\u00e1y h\\u00fat ch\\u00e2n kh\\u00f4ng\\n- B\\u1ed9 \\u0111\\u1ed3ng h\\u1ed3 \\u0111o \\u00e1p su\\u1ea5t ga l\\u1ea1nh\",\"nam_su_dung\":\"2026\",\"sinh_vien\":\"Nguy\\u1ec5n Tr\\u01b0\\u1eddng Giang\\nPh\\u1ea1m Th\\u1ebf Th\\u1eafng\\nB\\u00e0ng Minh Ph\\u00fa\\nNguy\\u1ec5n Minh Qu\\u00e2n\\nHo\\u00e0ng V\\u0103n Huy\\n\\nPh\\u00f9ng Ng\\u1ecdc D\\u01b0\\u01a1ng\\nNguy\\u1ec5n Minh \\u0110\\u1ee9c\\nVi H\\u1ed3ng \\u0110\\u1ee9c\\nV\\u0169 \\u0110\\u00ecnh Hi\\u1ebfu\\nNguy\\u1ec5n Ch\\u00ed Thanh\",\"giang_vien\":\"\",\"ket_qua\":\"- Hi\\u1ec3u \\u0111\\u01b0\\u1ee3c c\\u00e1ch l\\u1eafp r\\u00e1p b\\u1ed9 \\u0111\\u1ed3ng h\\u1ed3 \\u0111o \\u00e1p su\\u1ea5t ga v\\u00e0o h\\u1ec7 th\\u1ed1ng, c\\u00e1ch h\\u00fat ch\\u00e2n kh\\u00f4ng.\\n- Th\\u1ef1c hi\\u1ec7n \\u0111\\u01b0\\u1ee3c c\\u00f4ng vi\\u1ec7c \\u0111o \\u00e1p su\\u1ea5t ga, v\\u1ec7 sinh phin l\\u1ecdc gi\\u00f3 \\u0111i\\u1ec1u h\\u00f2a.\",\"plannedHours\":0}', 0, 'TEACHER', '2026-05-12 20:23:30', '2026-05-12 20:23:30');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `plan_weeks`
--

CREATE TABLE `plan_weeks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `plan_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `week_label` varchar(255) NOT NULL,
  `planned_hours` int(11) NOT NULL DEFAULT 0,
  `actual_hours` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `plan_weeks`
--

INSERT INTO `plan_weeks` (`id`, `plan_id`, `user_id`, `week_label`, `planned_hours`, `actual_hours`, `created_at`, `updated_at`) VALUES
(29, 27, 75, '{\"startLesson\":7,\"endLesson\":8,\"plannedHours\":2,\"date\":\"2026-04-08, 2026-04-15, 2026-04-22\"}', 2, NULL, '2026-05-04 21:35:28', '2026-05-04 21:37:40'),
(30, 28, 7, '{\"startLesson\":3,\"endLesson\":4,\"plannedHours\":2,\"date\":\"2026-04-17\"}', 2, NULL, '2026-05-04 21:38:20', '2026-05-04 21:40:27'),
(32, 30, 5, '{\"startLesson\":7,\"endLesson\":9,\"plannedHours\":3,\"date\":\"2026-04-07\"}', 3, NULL, '2026-05-04 21:41:07', '2026-05-04 22:02:36'),
(33, 31, 9, '{\"startLesson\":4,\"endLesson\":5,\"plannedHours\":2,\"date\":\"2026-04-07, 2026-04-14, 2026-04-21\"}', 2, NULL, '2026-05-04 21:44:10', '2026-05-04 21:45:20'),
(34, 32, 4, '{\"startLesson\":2,\"endLesson\":3,\"plannedHours\":2,\"date\":\"2026-04-10, 2026-04-17, 2026-04-24\"}', 2, NULL, '2026-05-04 21:46:05', '2026-05-04 21:47:37'),
(35, 33, 8, '{\"startLesson\":9,\"endLesson\":10,\"plannedHours\":2,\"date\":\"2026-04-06\"}', 2, NULL, '2026-05-04 21:49:03', '2026-05-04 21:50:07'),
(36, 34, 11, '{\"startLesson\":1,\"endLesson\":3,\"plannedHours\":3}', 3, NULL, '2026-05-04 21:50:54', '2026-05-04 21:50:54'),
(37, 35, 11, '{\"startLesson\":3,\"endLesson\":5,\"plannedHours\":3,\"date\":\"2026-04-15\"}', 3, NULL, '2026-05-04 21:51:10', '2026-05-04 21:52:06'),
(38, 36, 10, '{\"startLesson\":7,\"endLesson\":9,\"plannedHours\":3,\"date\":\"2026-04-06, 2026-04-13, 2026-04-20, 2026-04-27\"}', 3, NULL, '2026-05-04 21:52:44', '2026-05-04 21:53:48'),
(40, 38, 49, '{\"startLesson\":2,\"endLesson\":3,\"plannedHours\":2,\"date\":\"2026-04-01, 2026-04-02, 2026-04-06, 2026-04-09, 2026-04-13, 2026-04-16, 2026-04-20, 2026-04-23, 2026-04-27\"}', 2, NULL, '2026-05-04 22:11:34', '2026-05-04 22:13:31'),
(41, 39, 51, '{\"startLesson\":2,\"endLesson\":4,\"plannedHours\":3,\"date\":\"2026-04-06, 2026-04-13, 2026-04-20\"}', 3, NULL, '2026-05-04 22:14:51', '2026-05-04 22:17:02'),
(42, 39, 51, '{\"date\":\"2026-04-08, 2026-04-15, 2026-04-22\",\"startLesson\":7,\"endLesson\":9,\"plannedHours\":3}', 3, NULL, '2026-05-04 22:17:02', '2026-05-04 22:17:02'),
(43, 40, 40, '{\"startLesson\":2,\"endLesson\":5,\"plannedHours\":4,\"date\":\"2026-04-03\"}', 4, NULL, '2026-05-04 22:18:47', '2026-05-04 22:21:21'),
(44, 40, 40, '{\"date\":\"2026-04-09, 2026-04-10, 2026-04-16, 2026-04-17, 2026-04-23, 2026-04-24\",\"startLesson\":2,\"endLesson\":5,\"plannedHours\":4}', 4, NULL, '2026-05-04 22:21:21', '2026-05-04 22:21:21'),
(48, 44, 75, '{\"startLesson\":7,\"endLesson\":9,\"plannedHours\":3,\"date\":\"2026-05-05, 2026-05-11, 2026-05-15, 2026-05-18\"}', 3, NULL, '2026-05-05 17:19:42', '2026-05-05 17:21:14'),
(49, 45, 75, '{\"startLesson\":1,\"endLesson\":3,\"plannedHours\":3}', 3, NULL, '2026-05-05 17:45:39', '2026-05-05 17:45:39'),
(50, 46, 32, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(51, 46, 32, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(52, 46, 32, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(53, 46, 32, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(54, 46, 32, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(55, 47, 32, '{\"plannedHours\":2,\"startLesson\":8,\"endLesson\":9,\"date\":\"2026-05-18\"}', 2, NULL, '2026-05-07 20:36:57', '2026-05-07 20:42:47'),
(56, 47, 32, '{\"plannedHours\":2,\"startLesson\":8,\"endLesson\":9,\"date\":\"2026-05-19\"}', 2, NULL, '2026-05-07 20:36:57', '2026-05-07 20:42:47'),
(57, 47, 32, '{\"plannedHours\":2,\"startLesson\":8,\"endLesson\":9,\"date\":\"2026-05-20\"}', 2, NULL, '2026-05-07 20:36:57', '2026-05-07 20:42:47'),
(58, 47, 32, '{\"plannedHours\":2,\"startLesson\":8,\"endLesson\":9,\"date\":\"2026-05-21\"}', 2, NULL, '2026-05-07 20:36:57', '2026-05-07 20:42:47'),
(59, 47, 32, '{\"plannedHours\":2,\"startLesson\":8,\"endLesson\":9,\"date\":\"2026-05-22\"}', 2, NULL, '2026-05-07 20:36:57', '2026-05-07 20:42:47'),
(61, 48, 65, '{\"plannedHours\":2,\"startLesson\":3,\"endLesson\":4,\"date\":\"\",\"actualHours\":2}', 2, NULL, '2026-05-08 00:06:05', '2026-05-12 20:15:58'),
(62, 48, 65, '{\"plannedHours\":2,\"startLesson\":2,\"endLesson\":3,\"date\":\"\"}', 2, NULL, '2026-05-08 00:06:05', '2026-05-08 00:12:45'),
(63, 48, 65, '{\"plannedHours\":2,\"startLesson\":2,\"endLesson\":3,\"date\":\"\"}', 2, NULL, '2026-05-08 00:06:05', '2026-05-08 00:12:45'),
(64, 48, 65, '{\"plannedHours\":4,\"startLesson\":1,\"endLesson\":4,\"date\":\"\"}', 4, NULL, '2026-05-08 00:06:05', '2026-05-08 00:12:45'),
(65, 49, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 05:59:00', '2026-05-10 05:59:00'),
(66, 49, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 05:59:00', '2026-05-10 05:59:00'),
(67, 49, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 05:59:00', '2026-05-10 05:59:00'),
(68, 49, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 05:59:00', '2026-05-10 05:59:00'),
(69, 49, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 05:59:00', '2026-05-10 05:59:00'),
(70, 50, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:03:28', '2026-05-10 06:03:28'),
(71, 50, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:03:28', '2026-05-10 06:03:28'),
(72, 50, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:03:28', '2026-05-10 06:03:28'),
(73, 50, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:03:28', '2026-05-10 06:03:28'),
(74, 50, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:03:28', '2026-05-10 06:03:28'),
(75, 51, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:04:25', '2026-05-10 06:04:25'),
(76, 51, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:04:25', '2026-05-10 06:04:25'),
(77, 51, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:04:25', '2026-05-10 06:04:25'),
(78, 51, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:04:25', '2026-05-10 06:04:25'),
(79, 51, 75, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:04:25', '2026-05-10 06:04:25'),
(80, 52, 77, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"2026-05-10, 2026-05-12, 2026-05-13\"}', 0, NULL, '2026-05-10 06:06:23', '2026-05-10 06:07:28'),
(81, 52, 77, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:06:23', '2026-05-10 06:06:23'),
(82, 52, 77, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:06:23', '2026-05-10 06:06:23'),
(83, 52, 77, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:06:23', '2026-05-10 06:06:23'),
(84, 52, 77, '{\"plannedHours\":0,\"startLesson\":1,\"endLesson\":3,\"date\":\"\"}', 0, NULL, '2026-05-10 06:06:23', '2026-05-10 06:06:23'),
(85, 53, 30, '{\"plannedHours\":4,\"startLesson\":2,\"endLesson\":5,\"date\":\"2026-05-14\"}', 4, NULL, '2026-05-12 20:15:52', '2026-05-12 20:22:29'),
(86, 53, 30, '{\"plannedHours\":4,\"startLesson\":2,\"endLesson\":5,\"date\":\"2026-05-15\"}', 4, NULL, '2026-05-12 20:15:52', '2026-05-12 20:22:29');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `role` varchar(255) NOT NULL DEFAULT 'TEACHER',
  `department_id` bigint(20) UNSIGNED DEFAULT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `status` varchar(255) NOT NULL DEFAULT 'ACTIVE',
  `avatar` varchar(255) DEFAULT NULL,
  `dob` date DEFAULT NULL,
  `gender` varchar(255) DEFAULT NULL,
  `contact_email` varchar(255) DEFAULT NULL,
  `pending_profile` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`pending_profile`))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `role`, `department_id`, `remember_token`, `created_at`, `updated_at`, `status`, `avatar`, `dob`, `gender`, `contact_email`, `pending_profile`) VALUES
(1, 'Quản trị hệ thống', '1000001', NULL, '$2y$12$Up2I2YT9YxN9DYflk9Ss9u9FIaZR9M3KTlfgfI3u6DPmcztCTZtQq', 'ADMIN', NULL, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34', 'ACTIVE', NULL, NULL, NULL, NULL, NULL),
(2, 'Nguyễn Trọng Các', '01006027', NULL, '$2y$12$GE.PVZkPL0wMwhGI7PKzSeGJSZpwE3md4wY6eujdEkMmq3jF8nRMi', 'BOARD', NULL, NULL, '2026-04-13 23:54:34', '2026-04-13 23:54:34', 'ACTIVE', NULL, NULL, NULL, NULL, NULL),
(4, 'Hoàng Thị An', '01007033', NULL, '$2y$12$nEGsUG0OE35Jy4Z9sZcQZ.JwNlBJv7jEoi7CfvwWRIQzE1NsBmRVS', 'TEACHER', 4, NULL, '2026-04-13 23:54:35', '2026-04-14 01:48:54', 'ACTIVE', NULL, NULL, 'Nữ', 'htan@saodo.edu.vn', NULL),
(5, 'Hoàng Thị Ngát', '01007029', NULL, '$2y$12$ewYITzq60dEVjJXbmKfgU.PPuxhyCALb37MFlIs2JeGyycuAx/hU6', 'TEACHER', 4, NULL, '2026-04-13 23:54:35', '2026-04-14 01:48:55', 'ACTIVE', NULL, NULL, 'Nữ', 'htngat@saodo.edu.vn', NULL),
(7, 'Nguyễn Thị Ánh Tuyết', '01007023', NULL, '$2y$12$udoGXJp7gaQy6JRnVjrVoeWnVi9ekBu8eYMHDXb16ifsXWNFtwrdq', 'TEACHER', 4, NULL, '2026-04-14 01:40:47', '2026-04-14 01:48:33', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(8, 'Nguyễn Thị Thu', '01007024', NULL, '$2y$12$pyDwR06D4Pz.YNeEOewQ8eba1wVp7Hg5B7nokH3MXA.RXQ5LGYne2', 'TEACHER', 4, NULL, '2026-04-14 01:41:22', '2026-04-14 01:48:34', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(9, 'Nguyễn Thị Bích Ngọc', '01007039', NULL, '$2y$12$VQPjMuknbH/Wa1Al0mcCQOXeqeXKDSej7dVkzVlC/OdVCbTBFz3vK', 'TEACHER', 4, NULL, '2026-04-14 01:41:54', '2026-04-14 01:48:35', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(10, 'Phạm Thị Tâm', '01021007', NULL, '$2y$12$JXidJJRVa7u4xVhxHH4MzeAKH.g8f.UrSfNzmliDNCWT.pifv1L42', 'TEACHER', 4, NULL, '2026-04-14 01:42:21', '2026-04-14 01:48:36', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(11, 'Vũ Bảo Tạo', '01007027', NULL, '$2y$12$GY/MIpNYnldQvKLZy.NTG.nC0B9CfkQYrdA1i8Mjo1Q4wvHgWjdO6', 'TEACHER', 4, NULL, '2026-04-14 01:43:02', '2026-04-14 01:48:37', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(13, 'Nguyễn Phương Tỵ', '01016002', NULL, '$2y$12$wgnX4SqVuRFB/lCdDtzzMOOELlRtcshinmrWWV1/gqpjNrAf3Q6wC', 'DEPT_HEAD', 1, NULL, '2026-04-14 01:44:06', '2026-04-14 01:46:22', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(14, 'Nguyễn Văn Hinh', '01004014', NULL, '$2y$12$sPuNUFwp1RFWjxniT67AiOOx7Vw9GtomNFVvDMuOfM2Wfpw7ZZzLG', 'DEPT_HEAD', 2, NULL, '2026-04-14 01:44:34', '2026-04-14 01:46:25', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(15, 'Nguyễn Đình Cương', '01001012', NULL, '$2y$12$W30BiLOSpPn1P08chss/WeNFm7AZwY5ou1Oq6RvFWTXAEflbAnvSe', 'DEPT_HEAD', 5, NULL, '2026-04-14 01:45:04', '2026-04-14 01:46:27', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(16, 'Tạ Văn Hiển', '01002007', NULL, '$2y$12$nU5.SFmIchL2ZecU7xD4xuFW4qy1kCv6hEiBolNNgdyN.uwbM4eQ6', 'DEPT_HEAD', 3, NULL, '2026-04-14 01:45:35', '2026-04-14 01:46:30', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(17, 'Nguyễn Thị Hiền', '01002008', NULL, '$2y$12$6RUUyG8qwC5w6Of7XNhucOJX49uSmnOz5ecfQyFZU2mRGZo8bJygO', 'TEACHER', 3, NULL, '2026-04-14 01:55:26', '2026-04-14 17:20:50', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(18, 'Bùi Thị Loan', '01002011', NULL, '$2y$12$oYu//s98/gJP3XdAUslrgOv4ciEhFBieIX2bhVAE6oy9pulP1Gw.2', 'TEACHER', 3, NULL, '2026-04-14 01:55:57', '2026-04-14 17:20:51', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(19, 'Nguyễn Thị Hằng', '01002012', NULL, '$2y$12$wi6e9132uzs/ml8EHI90OuI46QRRqEjNkcopzfxTEIOgGwCxsQ15.', 'TEACHER', 3, NULL, '2026-04-14 01:56:22', '2026-04-14 17:20:53', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(20, 'Nguyễn Quang Thoại', '01002013', NULL, '$2y$12$qImDvB7yZtANPd1EtPNyXuji9Ml5O0A2GCiTFWSa/7/q8O755QgTe', 'TEACHER', 3, NULL, '2026-04-14 01:56:44', '2026-04-14 17:20:54', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(21, 'Đỗ Thị Làn', '01002019', NULL, '$2y$12$XOVWAExwm/iQDn/iB3bRReTuiwWtvEcC1lzF2OCBSmmgMfabrmldu', 'TEACHER', 3, NULL, '2026-04-14 01:57:08', '2026-04-14 17:20:55', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(22, 'Nguyễn Thị Hồi', '01002021', NULL, '$2y$12$QvJbXokUVwUqzlZTI745u.ZgDDtS1OK7b458fPaC7CD2py/kX.Sc6', 'TEACHER', 3, NULL, '2026-04-14 01:57:33', '2026-04-14 17:20:56', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(23, 'Vũ Thành Trung', '01001003', NULL, '$2y$12$1i8A4M1d182I/BurhpfBZ.x77RHb.3/lO/Akn/1LZLbiMJdnSX8EK', 'TEACHER', 5, NULL, '2026-04-14 01:58:40', '2026-04-14 17:21:34', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(24, 'Cao Huy Giáp', '01001004', NULL, '$2y$12$odD56EZnViRKjaPAIDfFHeK.LXhUSEPOmL68vX2iesUBv4GMHhUC6', 'TEACHER', 5, NULL, '2026-04-14 01:59:03', '2026-04-14 17:21:35', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(25, 'Lê Đức Thắng', '1021008', NULL, '$2y$12$Bk5n46Mo6raKKf3BtkYHKevYMQklYsL/JWEaeI/RgZRyv2SumGvAi', 'TEACHER', 5, NULL, '2026-04-14 01:59:24', '2026-04-14 17:21:36', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(26, 'Nguyễn Lương Căn', '01001006', NULL, '$2y$12$Sl/TtmtHuvrsPKIe80/0qOo/vhJ0a7V0ijO52Rt9M2vVRw.mO4pXu', 'TEACHER', 5, NULL, '2026-04-14 01:59:46', '2026-04-14 17:21:37', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(27, 'Phùng Đức Hải Anh', '01001011', NULL, '$2y$12$FNj2TtUXsDtQss3CDH/sF.w0ZbC9pPEK/1lEReVKKrJpms8wfcF7i', 'TEACHER', 5, NULL, '2026-04-14 02:00:07', '2026-04-14 17:21:38', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(28, 'Đỗ Tiến Quyết', '01001014', NULL, '$2y$12$vDVRmSWp23SRft5EfkBou.6cEOF5X1skoPJgKXevLYYXd7y8/w.lq', 'TEACHER', 5, NULL, '2026-04-14 02:00:31', '2026-04-14 17:21:39', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(29, 'Phạm Văn Trọng', '01001018', NULL, '$2y$12$E3NRUXTgLPfaKLmBSZnQ0etoi7o5Yfv9qND3QsiqQKseoOWRgs7sy', 'TEACHER', 5, NULL, '2026-04-14 02:00:56', '2026-04-14 17:21:40', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(30, 'Nguyễn Ngọc Đàm', '01004028', NULL, '$2y$12$8tJSw6P1hJmOhiUKWfW2NeBMLRGlnqneesiC4bPwZHs34jv9A/4G2', 'TEACHER', 5, NULL, '2026-04-14 02:02:37', '2026-04-14 17:21:41', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(31, 'Vũ Hoa Kỳ', '01004011', NULL, '$2y$12$GMLuvIE3F6CLiq.yB2/gZe.K0B7tuQ096WIeKQ34RbJFlIpGruqy2', 'TEACHER', 2, NULL, '2026-04-14 02:04:30', '2026-04-14 17:20:10', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(32, 'Mạc Văn Giang', '01004013', NULL, '$2y$12$bpd7eTJsqfGBhXJ4oRrPWeFeLYseKDuoLkSk8vDag/0QkMNt9ywZ2', 'TEACHER', 2, NULL, '2026-04-14 02:07:27', '2026-04-14 17:20:11', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(33, 'Nguyễn Danh Đạo', '01009014', NULL, '$2y$12$L1a1Oti7yagWInuc7plqzO19EXdZUJh8ObODBhnmk7KFkVMjhu4fC', 'TEACHER', 2, NULL, '2026-04-14 02:07:50', '2026-04-14 17:20:12', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(34, 'Đào Văn Kiên', '01004030', NULL, '$2y$12$9ACe.12vzQX5GHKF.jvLQ.E5p00O09qmXCJN3xtKG20G8dgE5HbRG', 'TEACHER', 2, NULL, '2026-04-14 02:08:11', '2026-04-14 17:20:13', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(35, 'Mạc Thị Nguyên', '01004036', NULL, '$2y$12$fY6ETkfRzymmI0ksHhh5luNf0AVTunX0cEHC3.EyZXjYf69NpD4xu', 'TEACHER', 2, NULL, '2026-04-14 02:08:35', '2026-04-14 17:20:14', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(36, 'Nguyễn Thị Hồng Nhung', '01004037', NULL, '$2y$12$GUQJ3ekt0xzkkQWxUro7cun0MgU0os3cnZJ5aS0FgOVtSN3rWtt3a', 'TEACHER', 2, NULL, '2026-04-14 02:08:58', '2026-04-14 17:20:14', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(37, 'Nguyễn Thị Liễu', '01004040', NULL, '$2y$12$E8zhRGbHgx5rQeU9yU/WMeajvmH6J/p6BTycq0I6LNb5qlh1Sdcmy', 'TEACHER', 2, NULL, '2026-04-14 02:09:19', '2026-04-14 17:20:16', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(38, 'Dương Thị Hà', '01004055', NULL, '$2y$12$CHUIO/FoZllDA5uftKR9v./4KxEKFP1WmOMZDx/filHii4FD.xprK', 'TEACHER', 2, NULL, '2026-04-14 02:09:42', '2026-04-14 17:20:17', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(39, 'Trịnh Văn Cường', '01005030', NULL, '$2y$12$gTI5ZA1jc2DEIBDQu3ySl.6IMwAj25wVEudqQpvhXD6NpgUgPcBnW', 'TEACHER', 2, NULL, '2026-04-14 02:14:28', '2026-04-14 17:20:18', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(40, 'Nguyễn Hữu Chấn', '01014013', NULL, '$2y$12$8rZltkTf8EWjVL80z5jJV.uZKHQp3v17nP462alFR8QyWmM/Iz0Iu', 'TEACHER', 2, NULL, '2026-04-14 02:14:54', '2026-04-14 17:20:20', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(41, 'Nguyễn Thị Tâm', '01006005', NULL, '$2y$12$DvLNbzvqmrynw5foTtHN0.cFARDvxdD.2v6DUPc075sLcHsMtNwPS', 'TEACHER', 1, NULL, '2026-04-14 02:15:44', '2026-04-14 17:19:28', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(42, 'Tạ Thị Mai', '01006007', NULL, '$2y$12$RZykbmkU8abkHO7SwlWPheCrvrNqmEuVZTN0Al8/raemWGB4o0WG6', 'TEACHER', 1, NULL, '2026-04-14 02:16:03', '2026-04-14 17:19:29', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(43, 'Lê Ngọc Hòa', '01006008', NULL, '$2y$12$QhYqqwaASKTd2xPk6KM5YeKb5fFksP6WsxB8lN.qPrY5aSLPfdBUy', 'TEACHER', 1, NULL, '2026-04-14 02:16:24', '2026-04-14 17:19:30', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(44, 'Đỗ Huy tùng', '01006009', NULL, '$2y$12$omA0oLtnbBnjZ7rW6JolWeg5iIorF9hQf0Mro6IaNMlEZtNINtcee', 'TEACHER', 1, NULL, '2026-04-14 02:16:47', '2026-04-14 17:19:30', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(45, 'Phạm Văn Tuấn', '01006020', NULL, '$2y$12$rDBMPeR3k9CSHbVnpCVbfeLR9QB2RXV1Nc1sfiQS8KcYHxAEUKufO', 'TEACHER', 1, NULL, '2026-04-14 02:17:12', '2026-04-14 17:19:31', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(46, 'Phạm Đức Khẩn', '01006021', NULL, '$2y$12$TXxKIjMcrk.hlsN.qf6hY.5C02CHJDV9a3BhQx0wbkGW7.v2ftMJu', 'TEACHER', 1, NULL, '2026-04-14 02:17:32', '2026-04-14 17:19:32', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(47, 'Nguyễn Trương Huy', '01006023', NULL, '$2y$12$STW06CS5x9Z3FSV5.Lh5Qe/O8.K0.k4S3k0fBHn79PqumP2BUgSR6', 'TEACHER', 1, NULL, '2026-04-14 02:17:59', '2026-04-14 17:19:32', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(48, 'Đặng Văn Tuệ', '01006024', NULL, '$2y$12$6ag8UjS50p1irnXxRLkg4eZACp86kCeX/n7lTRvYDnNS6CLYGw6.q', 'TEACHER', 1, NULL, '2026-04-14 02:18:17', '2026-04-14 17:19:33', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(49, 'Phạm Văn Tài', '01006033', NULL, '$2y$12$qvRGM6VbsE7sBBguzlv.OeKU.gtpT/il6z.1/54IXAQ/dkG3azfty', 'TEACHER', 1, NULL, '2026-04-14 02:18:38', '2026-04-14 17:19:34', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(50, 'Phạm Công Tảo', '01006034', NULL, '$2y$12$Vam/W4odL.I.EwfhChAvn.QMIBGjMi5KLVnkqO9Bd1POKNkMCbT1e', 'TEACHER', 1, NULL, '2026-04-14 02:18:57', '2026-04-14 17:19:34', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(51, 'Vũ Hồng Phong', '01006037', NULL, '$2y$12$bKMyy4.1c7K7cYuZFAmmweYLAmTp3EfGT6OLrU8aMGowV54tJXj1G', 'TEACHER', 1, NULL, '2026-04-14 02:19:18', '2026-04-14 17:19:35', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(52, 'Lê Văn Sơn', '01007012', NULL, '$2y$12$VE0ITAdepgeQftZ0O3MCDOU.J8OJdowNq3mZczBOwxRuUD5Progmy', 'TEACHER', 1, NULL, '2026-04-14 02:19:38', '2026-04-14 17:19:36', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(53, 'Vũ Trí Võ', '01007013', NULL, '$2y$12$yvWWfx2/5f.ZfWWQ/QK.heoUFn2G.LLDpuTOmN2JHejFNxE4C0hYC', 'TEACHER', 1, NULL, '2026-04-14 02:19:54', '2026-04-14 17:19:37', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(54, 'Nguyễn Văn Tiến', '01007021', NULL, '$2y$12$jbEXMadyrkIWOcs0CNz0CuRJAMetcK2AYVOp3fSPp.3A8GlnOg0HO', 'TEACHER', 1, NULL, '2026-04-14 02:20:14', '2026-04-14 17:19:37', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(55, 'Nguyễn Tiến Phúc', '01007026', NULL, '$2y$12$BJkzC0rTY2SNZAHDYRyknOv752pjpQQb/09E1jhuP1k8W3MUxNTw6', 'TEACHER', 1, NULL, '2026-04-14 02:20:35', '2026-04-14 17:19:38', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(56, 'Nguyễn Thị Quyên', '01007028', NULL, '$2y$12$mILgBl.X014mHjCYr0o3yuOCU5RrSkn3CKWMoCoHs.tkfzit1hfpi', 'TEACHER', 1, NULL, '2026-04-14 02:20:57', '2026-04-14 17:19:38', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(57, 'Dương Thị Hoa', '01006049', NULL, '$2y$12$4jy6FAP2DmxJ6.PHWQTtNuboUHQWuWob4EAgb7NtFUhW3M1TJt3yK', 'TEACHER', 1, NULL, '2026-04-14 02:21:14', '2026-04-14 17:19:39', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(58, 'Nguyễn Thị Việt Hương', '01006040', NULL, '$2y$12$8txiF1nAGC484JKXNcBtrOGGC8ATRlh57kyhY2oeILiX.MXvbdEuK', 'TEACHER', 1, NULL, '2026-04-14 02:21:35', '2026-04-14 17:19:40', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(59, 'Lương Thị Thanh Xuân', '01006038', NULL, '$2y$12$iXkNdVrfwo925IrylWuBq./73MJzCLHpRBBuEHNSbtjTRdOgAL4eS', 'TEACHER', 1, NULL, '2026-04-14 02:21:58', '2026-04-14 17:19:40', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(60, 'Nguyễn Thị Phương Oanh', '01006036', NULL, '$2y$12$pylG7jxdfbmAlc.AeAVEhuji44VOAkAKnhslQs9l81RuozIsHbjxC', 'TEACHER', 1, NULL, '2026-04-14 02:22:25', '2026-04-20 22:46:20', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(61, 'Lê Thị Mai', '1021009', NULL, '$2y$12$./h82SQ1.OlO3Pr5uM1k8.X/XQxRpYYmTTQXO3Zitr37efeWNqjpe', 'TEACHER', 1, NULL, '2026-04-14 02:22:45', '2026-04-14 17:19:43', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(62, 'Nguyễn Thị Phương', '01006029', NULL, '$2y$12$5oPQBT8wxLD8j6LwgTGfbuqxMYRyl6XDdAkCqmSy9bkGXOkFsQuWu', 'TEACHER', 1, NULL, '2026-04-14 02:23:10', '2026-04-14 17:19:43', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(63, 'Phạm Thị Thảo', '01006028', NULL, '$2y$12$pnYSmq6EsjDr.xXs47tKtOM8QDR1WuOM1hvM9FS45grg.henbU.3a', 'TEACHER', 1, NULL, '2026-04-14 02:23:31', '2026-04-14 17:19:44', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(64, 'Nguyễn Thị Thảo', '01006026', NULL, '$2y$12$ivM7DhK4k9onSv/JYRVnXuzTwYWSJutwnr9VPahhrtf2aNRpwXTQy', 'TEACHER', 1, NULL, '2026-04-14 02:23:52', '2026-04-14 17:19:45', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(65, 'Nguyễn Thị Sim', '01006011', NULL, '$2y$12$GJ1MO3VVFUfJY8C2r3jF/uOWHkCTbqRdrQhrX.zmOgdUYl75XdzL6', 'TEACHER', 1, NULL, '2026-04-14 02:24:37', '2026-04-14 17:19:46', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(66, 'Nguyễn Trọng Quỳnh', '01022001', NULL, '$2y$12$OP8WiHOq9foOa4d/uXoyVuxWcug4L5VS1RxEi67Zd1PGpMLIh01gO', 'TEACHER', 1, NULL, '2026-04-14 02:27:13', '2026-04-14 17:19:48', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(67, 'Vũ Quang Ngọc', '01015013', NULL, '$2y$12$JsfRPmkrarPWrk5JGxVZWejMqcM6bGl/M3BzeWztP7xKAtgRxfj6C', 'TEACHER', 1, NULL, '2026-04-14 02:27:53', '2026-04-14 17:19:49', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(68, 'Phạm Thị Kim Phúc', '01002006', NULL, '$2y$12$wUBfU41erkEFRjyzSWAKHeDZX0vJtLyBcCvoFmBKbAtu6M0varsma', 'TEACHER', 3, NULL, '2026-04-14 17:25:59', '2026-04-14 17:26:32', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(70, 'Tạ Hồng Phong', '01021005', NULL, '$2y$12$zrFHxpJvyyl2FOXUCFBaDuOqeUzAdpJYW6.e50BpZljOE5FGsu.G2', 'QC', 7, NULL, '2026-04-14 17:28:49', '2026-04-14 19:22:39', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL),
(72, 'Đỗ Thị Tần', '01002005', NULL, '$2y$12$D3CB/G14iGXADEc022bKIeU15g5Uorr9a/wBaEapm2pEVO3IJq3m6', 'QC', 7, NULL, '2026-04-14 19:09:50', '2026-04-14 19:22:41', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(74, 'Phạm Thị Hoan', '01001010', NULL, '$2y$12$3uzPp0rlMOz9uUmMxFXLX.Lho9EFIV8yShBnHOyFgPgI0kAQMq4Zy', 'TEACHER', 1, NULL, '2026-04-20 22:45:03', '2026-04-20 22:46:29', 'ACTIVE', NULL, NULL, 'Nữ', NULL, NULL),
(75, 'Phạm Thị Hường', '01007003', NULL, '$2y$12$RTxrEy1fyiSU7vx6mj8mV.6GpSwDpRT3KR6SXHaaf.SRvE0nVj47K', 'TEACHER', 4, NULL, '2026-05-04 10:10:30', '2026-05-04 10:14:28', 'ACTIVE', NULL, '1981-03-08', 'Nữ', NULL, NULL),
(76, 'Phạm Văn Kiên', '01007002', NULL, '$2y$12$rFyeXRXkryKQRORp4k0QX.ik7dHfBlmb4KtEJQGq3jvERGWDyv/Im', 'DEPT_HEAD', 4, NULL, '2026-05-04 10:19:16', '2026-05-04 10:20:01', 'ACTIVE', NULL, '1979-11-21', 'Nam', NULL, NULL),
(77, 'test', '1022002', NULL, '$2y$12$fFUGxtdZkHVnFnTHwdY15uZGq13bDASBgSr6o6tHG1CsqrUSVzOmq', 'TEACHER', 4, NULL, '2026-05-10 06:05:18', '2026-05-10 06:05:44', 'ACTIVE', NULL, NULL, 'Nam', NULL, NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `user_activities`
--

CREATE TABLE `user_activities` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `type` varchar(255) NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `user_activities`
--

INSERT INTO `user_activities` (`id`, `user_id`, `type`, `description`, `created_at`, `updated_at`) VALUES
(4, 5, 'login', 'Đăng nhập thành công', '2026-04-14 01:39:03', '2026-04-14 01:39:03'),
(5, 5, 'request_update_profile', 'Gửi yêu cầu cập nhật hồ sơ', '2026-04-14 01:39:36', '2026-04-14 01:39:36'),
(6, 4, 'login', 'Đăng nhập thành công', '2026-04-14 01:39:51', '2026-04-14 01:39:51'),
(7, 4, 'request_update_profile', 'Gửi yêu cầu cập nhật hồ sơ', '2026-04-14 01:40:11', '2026-04-14 01:40:11'),
(8, 2, 'login', 'Đăng nhập thành công', '2026-04-14 01:46:04', '2026-04-14 01:46:04'),
(12, 2, 'login', 'Đăng nhập thành công', '2026-04-14 01:50:59', '2026-04-14 01:50:59'),
(14, 2, 'login', 'Đăng nhập thành công', '2026-04-14 01:53:20', '2026-04-14 01:53:20'),
(15, 13, 'login', 'Đăng nhập thành công', '2026-04-14 17:17:27', '2026-04-14 17:17:27'),
(17, 2, 'login', 'Đăng nhập thành công', '2026-04-14 17:18:35', '2026-04-14 17:18:35'),
(18, 13, 'login', 'Đăng nhập thành công', '2026-04-14 17:19:21', '2026-04-14 17:19:21'),
(19, 14, 'login', 'Đăng nhập thành công', '2026-04-14 17:20:06', '2026-04-14 17:20:06'),
(20, 16, 'login', 'Đăng nhập thành công', '2026-04-14 17:20:37', '2026-04-14 17:20:37'),
(21, 15, 'login', 'Đăng nhập thành công', '2026-04-14 17:21:25', '2026-04-14 17:21:25'),
(24, 2, 'login', 'Đăng nhập thành công', '2026-04-14 17:23:31', '2026-04-14 17:23:31'),
(25, 16, 'login', 'Đăng nhập thành công', '2026-04-14 17:24:24', '2026-04-14 17:24:24'),
(26, 2, 'login', 'Đăng nhập thành công', '2026-04-14 17:25:05', '2026-04-14 17:25:05'),
(27, 2, 'login', 'Đăng nhập thành công', '2026-04-14 17:26:08', '2026-04-14 17:26:08'),
(28, 16, 'login', 'Đăng nhập thành công', '2026-04-14 17:26:25', '2026-04-14 17:26:25'),
(29, 16, 'login', 'Đăng nhập thành công', '2026-04-14 17:29:10', '2026-04-14 17:29:10'),
(30, 2, 'login', 'Đăng nhập thành công', '2026-04-14 17:29:29', '2026-04-14 17:29:29'),
(33, 16, 'login', 'Đăng nhập thành công', '2026-04-14 19:01:02', '2026-04-14 19:01:02'),
(34, 2, 'login', 'Đăng nhập thành công', '2026-04-14 19:01:48', '2026-04-14 19:01:48'),
(35, 2, 'login', 'Đăng nhập thành công', '2026-04-14 19:04:26', '2026-04-14 19:04:26'),
(36, 2, 'login', 'Đăng nhập thành công', '2026-04-14 19:10:13', '2026-04-14 19:10:13'),
(37, 2, 'login', 'Đăng nhập thành công', '2026-04-14 19:20:56', '2026-04-14 19:20:56'),
(38, 2, 'login', 'Đăng nhập thành công', '2026-04-14 19:22:20', '2026-04-14 19:22:20'),
(39, 2, 'login', 'Đăng nhập thành công', '2026-04-14 19:32:50', '2026-04-14 19:32:50'),
(40, 2, 'login', 'Đăng nhập thành công', '2026-04-14 19:37:56', '2026-04-14 19:37:56'),
(41, 2, 'login', 'Đăng nhập thành công', '2026-04-14 19:38:21', '2026-04-14 19:38:21'),
(43, 2, 'login', 'Đăng nhập thành công', '2026-04-16 02:11:45', '2026-04-16 02:11:45'),
(44, 2, 'login', 'Đăng nhập thành công', '2026-04-16 02:12:33', '2026-04-16 02:12:33'),
(49, 2, 'login', 'Đăng nhập thành công', '2026-04-16 02:30:21', '2026-04-16 02:30:21'),
(50, 72, 'login', 'Đăng nhập thành công', '2026-04-16 02:38:13', '2026-04-16 02:38:13'),
(53, 72, 'login', 'Đăng nhập thành công', '2026-04-20 19:33:55', '2026-04-20 19:33:55'),
(56, 72, 'login', 'Đăng nhập thành công', '2026-04-20 22:27:38', '2026-04-20 22:27:38'),
(57, 60, 'login', 'Đăng nhập thành công', '2026-04-20 22:45:26', '2026-04-20 22:45:26'),
(58, 60, 'request_update_profile', 'Gửi yêu cầu cập nhật hồ sơ', '2026-04-20 22:45:42', '2026-04-20 22:45:42'),
(59, 13, 'login', 'Đăng nhập thành công', '2026-04-20 22:46:00', '2026-04-20 22:46:00'),
(60, 2, 'login', 'Đăng nhập thành công', '2026-04-20 22:46:53', '2026-04-20 22:46:53'),
(65, 4, 'login', 'Đăng nhập thành công', '2026-04-21 17:55:12', '2026-04-21 17:55:12'),
(66, 4, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0003)', '2026-04-21 17:55:17', '2026-04-21 17:55:17'),
(67, 4, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0003)', '2026-04-21 17:57:38', '2026-04-21 17:57:38'),
(69, 72, 'login', 'Đăng nhập thành công', '2026-04-21 18:01:22', '2026-04-21 18:01:22'),
(70, 26, 'login', 'Đăng nhập thành công', '2026-04-21 18:03:37', '2026-04-21 18:03:37'),
(71, 26, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0004)', '2026-04-21 18:03:44', '2026-04-21 18:03:44'),
(72, 26, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0004)', '2026-04-21 18:04:54', '2026-04-21 18:04:54'),
(73, 15, 'login', 'Đăng nhập thành công', '2026-04-21 18:05:14', '2026-04-21 18:05:14'),
(74, 72, 'login', 'Đăng nhập thành công', '2026-04-21 18:05:41', '2026-04-21 18:05:41'),
(75, 2, 'login', 'Đăng nhập thành công', '2026-04-21 18:07:46', '2026-04-21 18:07:46'),
(81, 2, 'login', 'Đăng nhập thành công', '2026-04-21 18:13:01', '2026-04-21 18:13:01'),
(84, 2, 'login', 'Đăng nhập thành công', '2026-04-21 18:15:24', '2026-04-21 18:15:24'),
(85, 8, 'login', 'Đăng nhập thành công', '2026-04-21 18:16:37', '2026-04-21 18:16:37'),
(86, 8, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0006)', '2026-04-21 18:16:42', '2026-04-21 18:16:42'),
(87, 8, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0006)', '2026-04-21 18:17:58', '2026-04-21 18:17:58'),
(89, 2, 'login', 'Đăng nhập thành công', '2026-04-21 18:18:40', '2026-04-21 18:18:40'),
(90, 8, 'login', 'Đăng nhập thành công', '2026-04-21 18:19:06', '2026-04-21 18:19:06'),
(91, 2, 'login', 'Đăng nhập thành công', '2026-04-21 18:19:40', '2026-04-21 18:19:40'),
(92, 10, 'login', 'Đăng nhập thành công', '2026-04-21 18:22:26', '2026-04-21 18:22:26'),
(93, 10, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0007)', '2026-04-21 18:22:30', '2026-04-21 18:22:30'),
(94, 10, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0007)', '2026-04-21 18:22:52', '2026-04-21 18:22:52'),
(96, 2, 'login', 'Đăng nhập thành công', '2026-04-21 18:23:42', '2026-04-21 18:23:42'),
(97, 2, 'login', 'Đăng nhập thành công', '2026-04-21 18:25:44', '2026-04-21 18:25:44'),
(98, 72, 'login', 'Đăng nhập thành công', '2026-04-21 18:33:01', '2026-04-21 18:33:01'),
(99, 72, 'login', 'Đăng nhập thành công', '2026-04-21 18:39:15', '2026-04-21 18:39:15'),
(102, 2, 'login', 'Đăng nhập thành công', '2026-04-21 18:56:52', '2026-04-21 18:56:52'),
(103, 17, 'login', 'Đăng nhập thành công', '2026-04-21 19:06:53', '2026-04-21 19:06:53'),
(104, 17, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0009)', '2026-04-21 19:06:59', '2026-04-21 19:06:59'),
(105, 17, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0009)', '2026-04-21 19:08:56', '2026-04-21 19:08:56'),
(106, 16, 'login', 'Đăng nhập thành công', '2026-04-21 19:09:23', '2026-04-21 19:09:23'),
(107, 17, 'login', 'Đăng nhập thành công', '2026-04-21 19:10:16', '2026-04-21 19:10:16'),
(108, 17, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0010)', '2026-04-21 19:10:23', '2026-04-21 19:10:23'),
(109, 17, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0011)', '2026-04-21 19:11:12', '2026-04-21 19:11:12'),
(110, 16, 'login', 'Đăng nhập thành công', '2026-04-21 19:11:30', '2026-04-21 19:11:30'),
(111, 21, 'login', 'Đăng nhập thành công', '2026-04-21 19:12:00', '2026-04-21 19:12:00'),
(112, 21, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0012)', '2026-04-21 19:12:02', '2026-04-21 19:12:02'),
(113, 21, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0012)', '2026-04-21 19:12:53', '2026-04-21 19:12:53'),
(114, 16, 'login', 'Đăng nhập thành công', '2026-04-21 19:13:07', '2026-04-21 19:13:07'),
(115, 17, 'login', 'Đăng nhập thành công', '2026-04-21 19:20:13', '2026-04-21 19:20:13'),
(116, 17, 'login', 'Đăng nhập thành công', '2026-04-21 19:21:09', '2026-04-21 19:21:09'),
(117, 17, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0013)', '2026-04-21 19:21:14', '2026-04-21 19:21:14'),
(118, 16, 'login', 'Đăng nhập thành công', '2026-04-21 19:22:14', '2026-04-21 19:22:14'),
(119, 72, 'login', 'Đăng nhập thành công', '2026-04-21 19:23:05', '2026-04-21 19:23:05'),
(120, 2, 'login', 'Đăng nhập thành công', '2026-04-21 19:28:56', '2026-04-21 19:28:56'),
(122, 2, 'login', 'Đăng nhập thành công', '2026-04-21 19:33:08', '2026-04-21 19:33:08'),
(123, 2, 'login', 'Đăng nhập thành công', '2026-04-21 22:33:03', '2026-04-21 22:33:03'),
(124, 2, 'login', 'Đăng nhập thành công', '2026-04-21 22:34:11', '2026-04-21 22:34:11'),
(125, 2, 'login', 'Đăng nhập thành công', '2026-04-22 19:18:43', '2026-04-22 19:18:43'),
(126, 2, 'login', 'Đăng nhập thành công', '2026-04-24 01:43:49', '2026-04-24 01:43:49'),
(127, 1, 'login', 'Đăng nhập thành công', '2026-04-24 02:19:18', '2026-04-24 02:19:18'),
(133, 75, 'login', 'Đăng nhập thành công', '2026-05-04 10:15:25', '2026-05-04 10:15:25'),
(134, 2, 'login', 'Đăng nhập thành công', '2026-05-04 10:19:39', '2026-05-04 10:19:39'),
(135, 75, 'login', 'Đăng nhập thành công', '2026-05-04 10:21:32', '2026-05-04 10:21:32'),
(136, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0001)', '2026-05-04 10:23:20', '2026-05-04 10:23:20'),
(137, 75, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0001)', '2026-05-04 10:29:05', '2026-05-04 10:29:05'),
(138, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0015)', '2026-05-04 10:29:54', '2026-05-04 10:29:54'),
(139, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0016)', '2026-05-04 10:34:25', '2026-05-04 10:34:25'),
(140, 75, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0001)', '2026-05-04 10:44:32', '2026-05-04 10:44:32'),
(141, 76, 'login', 'Đăng nhập thành công', '2026-05-04 10:47:34', '2026-05-04 10:47:34'),
(142, 7, 'login', 'Đăng nhập thành công', '2026-05-04 10:48:57', '2026-05-04 10:48:57'),
(143, 7, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0015)', '2026-05-04 10:49:21', '2026-05-04 10:49:21'),
(144, 7, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0015)', '2026-05-04 10:54:04', '2026-05-04 10:54:04'),
(145, 5, 'login', 'Đăng nhập thành công', '2026-05-04 10:54:43', '2026-05-04 10:54:43'),
(146, 5, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0018)', '2026-05-04 10:54:50', '2026-05-04 10:54:50'),
(147, 5, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0018)', '2026-05-04 10:55:55', '2026-05-04 10:55:55'),
(148, 4, 'login', 'Đăng nhập thành công', '2026-05-04 10:56:30', '2026-05-04 10:56:30'),
(149, 4, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0019)', '2026-05-04 10:56:39', '2026-05-04 10:56:39'),
(150, 4, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0019)', '2026-05-04 10:57:50', '2026-05-04 10:57:50'),
(151, 10, 'login', 'Đăng nhập thành công', '2026-05-04 10:58:25', '2026-05-04 10:58:25'),
(152, 10, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0020)', '2026-05-04 10:58:30', '2026-05-04 10:58:30'),
(153, 10, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0020)', '2026-05-04 11:00:00', '2026-05-04 11:00:00'),
(154, 9, 'login', 'Đăng nhập thành công', '2026-05-04 11:00:46', '2026-05-04 11:00:46'),
(155, 9, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0021)', '2026-05-04 11:00:52', '2026-05-04 11:00:52'),
(156, 9, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0021)', '2026-05-04 11:01:51', '2026-05-04 11:01:51'),
(157, 8, 'login', 'Đăng nhập thành công', '2026-05-04 11:02:17', '2026-05-04 11:02:17'),
(158, 8, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0022)', '2026-05-04 11:02:24', '2026-05-04 11:02:24'),
(159, 8, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0022)', '2026-05-04 11:03:00', '2026-05-04 11:03:00'),
(160, 11, 'login', 'Đăng nhập thành công', '2026-05-04 11:03:25', '2026-05-04 11:03:25'),
(161, 11, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0023)', '2026-05-04 11:03:31', '2026-05-04 11:03:31'),
(162, 11, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0023)', '2026-05-04 11:04:50', '2026-05-04 11:04:50'),
(163, 76, 'login', 'Đăng nhập thành công', '2026-05-04 11:05:30', '2026-05-04 11:05:30'),
(164, 72, 'login', 'Đăng nhập thành công', '2026-05-04 11:19:20', '2026-05-04 11:19:20'),
(165, 49, 'login', 'Đăng nhập thành công', '2026-05-04 11:22:34', '2026-05-04 11:22:34'),
(166, 49, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0024)', '2026-05-04 11:22:50', '2026-05-04 11:22:50'),
(167, 49, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0024)', '2026-05-04 11:24:06', '2026-05-04 11:24:06'),
(168, 51, 'login', 'Đăng nhập thành công', '2026-05-04 11:25:37', '2026-05-04 11:25:37'),
(169, 51, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0025)', '2026-05-04 11:25:42', '2026-05-04 11:25:42'),
(170, 51, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0025)', '2026-05-04 11:27:25', '2026-05-04 11:27:25'),
(171, 13, 'login', 'Đăng nhập thành công', '2026-05-04 11:29:27', '2026-05-04 11:29:27'),
(172, 72, 'login', 'Đăng nhập thành công', '2026-05-04 11:31:45', '2026-05-04 11:31:45'),
(173, 2, 'login', 'Đăng nhập thành công', '2026-05-04 11:36:16', '2026-05-04 11:36:16'),
(174, 75, 'login', 'Đăng nhập thành công', '2026-05-04 11:39:58', '2026-05-04 11:39:58'),
(175, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0026)', '2026-05-04 11:41:57', '2026-05-04 11:41:57'),
(176, 72, 'login', 'Đăng nhập thành công', '2026-05-04 11:48:56', '2026-05-04 11:48:56'),
(177, 2, 'login', 'Đăng nhập thành công', '2026-05-04 11:56:11', '2026-05-04 11:56:11'),
(178, 72, 'login', 'Đăng nhập thành công', '2026-05-04 12:02:58', '2026-05-04 12:02:58'),
(179, 2, 'login', 'Đăng nhập thành công', '2026-05-04 12:03:26', '2026-05-04 12:03:26'),
(180, 72, 'login', 'Đăng nhập thành công', '2026-05-04 12:04:28', '2026-05-04 12:04:28'),
(181, 2, 'login', 'Đăng nhập thành công', '2026-05-04 12:06:00', '2026-05-04 12:06:00'),
(182, 76, 'login', 'Đăng nhập thành công', '2026-05-04 12:07:01', '2026-05-04 12:07:01'),
(183, 75, 'login', 'Đăng nhập thành công', '2026-05-04 18:32:12', '2026-05-04 18:32:12'),
(184, 11, 'login', 'Đăng nhập thành công', '2026-05-04 21:10:18', '2026-05-04 21:10:18'),
(185, 7, 'login', 'Đăng nhập thành công', '2026-05-04 21:11:15', '2026-05-04 21:11:15'),
(186, 5, 'login', 'Đăng nhập thành công', '2026-05-04 21:12:08', '2026-05-04 21:12:08'),
(187, 4, 'login', 'Đăng nhập thành công', '2026-05-04 21:12:48', '2026-05-04 21:12:48'),
(188, 10, 'login', 'Đăng nhập thành công', '2026-05-04 21:14:17', '2026-05-04 21:14:17'),
(189, 8, 'login', 'Đăng nhập thành công', '2026-05-04 21:16:03', '2026-05-04 21:16:03'),
(190, 2, 'login', 'Đăng nhập thành công', '2026-05-04 21:16:32', '2026-05-04 21:16:32'),
(191, 49, 'login', 'Đăng nhập thành công', '2026-05-04 21:18:06', '2026-05-04 21:18:06'),
(192, 76, 'login', 'Đăng nhập thành công', '2026-05-04 21:18:48', '2026-05-04 21:18:48'),
(193, 75, 'login', 'Đăng nhập thành công', '2026-05-04 21:20:42', '2026-05-04 21:20:42'),
(194, 72, 'login', 'Đăng nhập thành công', '2026-05-04 21:21:47', '2026-05-04 21:21:47'),
(195, 75, 'login', 'Đăng nhập thành công', '2026-05-04 21:35:11', '2026-05-04 21:35:11'),
(196, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0026)', '2026-05-04 21:35:28', '2026-05-04 21:35:28'),
(197, 75, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0026)', '2026-05-04 21:37:40', '2026-05-04 21:37:40'),
(198, 7, 'login', 'Đăng nhập thành công', '2026-05-04 21:38:11', '2026-05-04 21:38:11'),
(199, 7, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0028)', '2026-05-04 21:38:20', '2026-05-04 21:38:20'),
(200, 7, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0028)', '2026-05-04 21:40:27', '2026-05-04 21:40:27'),
(201, 7, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0029)', '2026-05-04 21:40:42', '2026-05-04 21:40:42'),
(202, 5, 'login', 'Đăng nhập thành công', '2026-05-04 21:40:57', '2026-05-04 21:40:57'),
(203, 5, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0030)', '2026-05-04 21:41:07', '2026-05-04 21:41:07'),
(204, 5, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0030)', '2026-05-04 21:42:16', '2026-05-04 21:42:16'),
(205, 11, 'login', 'Đăng nhập thành công', '2026-05-04 21:42:31', '2026-05-04 21:42:31'),
(206, 9, 'login', 'Đăng nhập thành công', '2026-05-04 21:43:55', '2026-05-04 21:43:55'),
(207, 9, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0031)', '2026-05-04 21:44:10', '2026-05-04 21:44:10'),
(208, 9, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0031)', '2026-05-04 21:45:20', '2026-05-04 21:45:20'),
(209, 4, 'login', 'Đăng nhập thành công', '2026-05-04 21:45:59', '2026-05-04 21:45:59'),
(210, 4, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0032)', '2026-05-04 21:46:05', '2026-05-04 21:46:05'),
(211, 4, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0032)', '2026-05-04 21:47:37', '2026-05-04 21:47:37'),
(212, 8, 'login', 'Đăng nhập thành công', '2026-05-04 21:48:03', '2026-05-04 21:48:03'),
(213, 8, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0033)', '2026-05-04 21:49:03', '2026-05-04 21:49:03'),
(214, 8, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0033)', '2026-05-04 21:50:07', '2026-05-04 21:50:07'),
(215, 11, 'login', 'Đăng nhập thành công', '2026-05-04 21:50:47', '2026-05-04 21:50:47'),
(216, 11, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0034)', '2026-05-04 21:50:54', '2026-05-04 21:50:54'),
(217, 11, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0035)', '2026-05-04 21:51:10', '2026-05-04 21:51:10'),
(218, 11, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0035)', '2026-05-04 21:52:06', '2026-05-04 21:52:06'),
(219, 10, 'login', 'Đăng nhập thành công', '2026-05-04 21:52:36', '2026-05-04 21:52:36'),
(220, 10, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0036)', '2026-05-04 21:52:44', '2026-05-04 21:52:44'),
(221, 10, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0036)', '2026-05-04 21:53:48', '2026-05-04 21:53:48'),
(222, 5, 'login', 'Đăng nhập thành công', '2026-05-04 21:57:16', '2026-05-04 21:57:16'),
(223, 5, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0037)', '2026-05-04 21:57:19', '2026-05-04 21:57:19'),
(224, 5, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0030)', '2026-05-04 22:02:36', '2026-05-04 22:02:36'),
(225, 76, 'login', 'Đăng nhập thành công', '2026-05-04 22:03:23', '2026-05-04 22:03:23'),
(226, 75, 'login', 'Đăng nhập thành công', '2026-05-04 22:04:26', '2026-05-04 22:04:26'),
(227, 75, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0026)', '2026-05-04 22:04:41', '2026-05-04 22:04:41'),
(228, 7, 'login', 'Đăng nhập thành công', '2026-05-04 22:05:09', '2026-05-04 22:05:09'),
(229, 7, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0028)', '2026-05-04 22:06:03', '2026-05-04 22:06:03'),
(230, 8, 'login', 'Đăng nhập thành công', '2026-05-04 22:06:23', '2026-05-04 22:06:23'),
(231, 11, 'login', 'Đăng nhập thành công', '2026-05-04 22:06:48', '2026-05-04 22:06:48'),
(232, 5, 'login', 'Đăng nhập thành công', '2026-05-04 22:07:03', '2026-05-04 22:07:03'),
(233, 5, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0030)', '2026-05-04 22:07:30', '2026-05-04 22:07:30'),
(234, 4, 'login', 'Đăng nhập thành công', '2026-05-04 22:07:49', '2026-05-04 22:07:49'),
(235, 9, 'login', 'Đăng nhập thành công', '2026-05-04 22:08:03', '2026-05-04 22:08:03'),
(236, 9, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0031)', '2026-05-04 22:08:29', '2026-05-04 22:08:29'),
(237, 10, 'login', 'Đăng nhập thành công', '2026-05-04 22:08:44', '2026-05-04 22:08:44'),
(238, 76, 'login', 'Đăng nhập thành công', '2026-05-04 22:09:34', '2026-05-04 22:09:34'),
(239, 49, 'login', 'Đăng nhập thành công', '2026-05-04 22:11:24', '2026-05-04 22:11:24'),
(240, 49, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0037)', '2026-05-04 22:11:34', '2026-05-04 22:11:34'),
(241, 49, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0037)', '2026-05-04 22:13:31', '2026-05-04 22:13:31'),
(242, 49, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0037)', '2026-05-04 22:13:46', '2026-05-04 22:13:46'),
(243, 51, 'login', 'Đăng nhập thành công', '2026-05-04 22:14:36', '2026-05-04 22:14:36'),
(244, 51, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0039)', '2026-05-04 22:14:51', '2026-05-04 22:14:51'),
(245, 51, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0039)', '2026-05-04 22:17:02', '2026-05-04 22:17:02'),
(246, 40, 'login', 'Đăng nhập thành công', '2026-05-04 22:18:45', '2026-05-04 22:18:45'),
(247, 40, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0040)', '2026-05-04 22:18:47', '2026-05-04 22:18:47'),
(248, 40, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0040)', '2026-05-04 22:21:21', '2026-05-04 22:21:21'),
(249, 40, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0040)', '2026-05-04 22:23:09', '2026-05-04 22:23:09'),
(250, 2, 'login', 'Đăng nhập thành công', '2026-05-04 22:26:10', '2026-05-04 22:26:10'),
(251, 75, 'login', 'Đăng nhập thành công', '2026-05-05 00:15:48', '2026-05-05 00:15:48'),
(252, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0041)', '2026-05-05 00:16:13', '2026-05-05 00:16:13'),
(253, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0041)', '2026-05-05 00:16:57', '2026-05-05 00:16:57'),
(254, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0043)', '2026-05-05 00:21:15', '2026-05-05 00:21:15'),
(255, 2, 'login', 'Đăng nhập thành công', '2026-05-05 00:41:52', '2026-05-05 00:41:52'),
(256, 7, 'login', 'Đăng nhập thành công', '2026-05-05 00:43:02', '2026-05-05 00:43:02'),
(257, 7, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 4/2026 (KH-2026-0028)', '2026-05-05 00:43:19', '2026-05-05 00:43:19'),
(258, 75, 'login', 'Đăng nhập thành công', '2026-05-05 17:17:54', '2026-05-05 17:17:54'),
(259, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0041)', '2026-05-05 17:19:42', '2026-05-05 17:19:42'),
(260, 75, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0041)', '2026-05-05 17:21:14', '2026-05-05 17:21:14'),
(261, 75, 'login', 'Đăng nhập thành công', '2026-05-05 17:37:34', '2026-05-05 17:37:34'),
(262, 76, 'login', 'Đăng nhập thành công', '2026-05-05 17:39:35', '2026-05-05 17:39:35'),
(263, 72, 'login', 'Đăng nhập thành công', '2026-05-05 17:41:55', '2026-05-05 17:41:55'),
(264, 2, 'login', 'Đăng nhập thành công', '2026-05-05 17:44:29', '2026-05-05 17:44:29'),
(265, 75, 'login', 'Đăng nhập thành công', '2026-05-05 17:45:35', '2026-05-05 17:45:35'),
(266, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0045)', '2026-05-05 17:45:39', '2026-05-05 17:45:39'),
(267, 2, 'login', 'Đăng nhập thành công', '2026-05-05 18:02:18', '2026-05-05 18:02:18'),
(268, 5, 'login', 'Đăng nhập thành công', '2026-05-05 18:08:57', '2026-05-05 18:08:57'),
(269, 21, 'login', 'Đăng nhập thành công', '2026-05-06 02:38:07', '2026-05-06 02:38:07'),
(270, 16, 'login', 'Đăng nhập thành công', '2026-05-06 02:56:39', '2026-05-06 02:56:39'),
(271, 19, 'login', 'Đăng nhập thành công', '2026-05-06 07:38:53', '2026-05-06 07:38:53'),
(272, 68, 'login', 'Đăng nhập thành công', '2026-05-06 17:27:08', '2026-05-06 17:27:08'),
(273, 75, 'login', 'Đăng nhập thành công', '2026-05-07 19:29:18', '2026-05-07 19:29:18'),
(274, 32, 'login', 'Đăng nhập thành công', '2026-05-07 20:33:51', '2026-05-07 20:33:51'),
(275, 32, 'create_plan', 'Tạo kế hoạch KH khai thác thiết bị tháng 5-2026 (KH-2026-0046)', '2026-05-07 20:35:46', '2026-05-07 20:35:46'),
(276, 32, 'create_plan', 'Tạo kế hoạch KH khai thác thiết bị tháng 5-2026 (KH-2026-0047)', '2026-05-07 20:36:57', '2026-05-07 20:36:57'),
(277, 32, 'update_plan', 'Cập nhật kế hoạch KH khai thác thiết bị tháng 5-2026 (KH-2026-0047)', '2026-05-07 20:42:47', '2026-05-07 20:42:47'),
(278, 32, 'update_plan', 'Cập nhật kế hoạch KH khai thác thiết bị tháng 5-2026 (KH-2026-0047)', '2026-05-07 20:45:58', '2026-05-07 20:45:58'),
(279, 32, 'update_plan', 'Cập nhật kế hoạch KH khai thác thiết bị tháng 5-2026 (KH-2026-0047)', '2026-05-07 20:46:55', '2026-05-07 20:46:55'),
(280, 14, 'login', 'Đăng nhập thành công', '2026-05-07 20:49:48', '2026-05-07 20:49:48'),
(281, 65, 'login', 'Đăng nhập thành công', '2026-05-08 00:01:12', '2026-05-08 00:01:12'),
(282, 65, 'create_plan', 'Tạo kế hoạch KH KHAI THAC TB THANG 5.2026 BM TĐH (KH-2026-0048)', '2026-05-08 00:06:05', '2026-05-08 00:06:05'),
(283, 65, 'update_plan', 'Cập nhật kế hoạch KH KHAI THAC TB THANG 5.2026 BM TĐH (KH-2026-0048)', '2026-05-08 00:12:45', '2026-05-08 00:12:45'),
(284, 65, 'update_plan', 'Cập nhật kế hoạch KH KHAI THAC TB THANG 5.2026 BM TĐH (KH-2026-0048)', '2026-05-08 00:15:14', '2026-05-08 00:15:14'),
(285, 75, 'login', 'Đăng nhập thành công', '2026-05-10 05:56:42', '2026-05-10 05:56:42'),
(286, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 6/2026 (KH-2026-0049)', '2026-05-10 05:59:00', '2026-05-10 05:59:00'),
(287, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 3/2026 (KH-2026-0050)', '2026-05-10 06:03:28', '2026-05-10 06:03:28'),
(288, 75, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 6/2026 (KH-2026-0051)', '2026-05-10 06:04:25', '2026-05-10 06:04:25'),
(289, 76, 'login', 'Đăng nhập thành công', '2026-05-10 06:05:33', '2026-05-10 06:05:33'),
(290, 76, 'login', 'Đăng nhập thành công', '2026-05-10 06:05:59', '2026-05-10 06:05:59'),
(291, 77, 'login', 'Đăng nhập thành công', '2026-05-10 06:06:13', '2026-05-10 06:06:13'),
(292, 77, 'create_plan', 'Tạo kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0052)', '2026-05-10 06:06:23', '2026-05-10 06:06:23'),
(293, 77, 'update_plan', 'Cập nhật kế hoạch Kế hoạch công tác tháng 5/2026 (KH-2026-0052)', '2026-05-10 06:07:28', '2026-05-10 06:07:28'),
(294, 76, 'login', 'Đăng nhập thành công', '2026-05-10 06:07:40', '2026-05-10 06:07:40'),
(295, 77, 'login', 'Đăng nhập thành công', '2026-05-10 06:08:35', '2026-05-10 06:08:35'),
(296, 2, 'login', 'Đăng nhập thành công', '2026-05-10 17:38:15', '2026-05-10 17:38:15'),
(297, 75, 'login', 'Đăng nhập thành công', '2026-05-10 19:04:52', '2026-05-10 19:04:52'),
(298, 65, 'login', 'Đăng nhập thành công', '2026-05-10 19:09:46', '2026-05-10 19:09:46'),
(299, 72, 'login', 'Đăng nhập thành công', '2026-05-10 19:14:18', '2026-05-10 19:14:18'),
(300, 65, 'login', 'Đăng nhập thành công', '2026-05-10 19:41:17', '2026-05-10 19:41:17'),
(301, 72, 'login', 'Đăng nhập thành công', '2026-05-12 17:57:43', '2026-05-12 17:57:43'),
(302, 30, 'login', 'Đăng nhập thành công', '2026-05-12 20:13:57', '2026-05-12 20:13:57'),
(303, 30, 'create_plan', 'Tạo kế hoạch KH KT thang 05.2026 (KH-2026-0053)', '2026-05-12 20:15:52', '2026-05-12 20:15:52'),
(304, 65, 'update_plan', 'Cập nhật kế hoạch KH KHAI THAC TB THANG 5.2026 BM TĐH (KH-2026-0048)', '2026-05-12 20:15:58', '2026-05-12 20:15:58'),
(305, 30, 'update_plan', 'Cập nhật kế hoạch KH KT thang 05.2026 (KH-2026-0053)', '2026-05-12 20:22:29', '2026-05-12 20:22:29'),
(306, 30, 'update_plan', 'Cập nhật kế hoạch KH KT thang 05.2026 (KH-2026-0053)', '2026-05-12 20:23:30', '2026-05-12 20:23:30');

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `audit_logs`
--
ALTER TABLE `audit_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `audit_logs_plan_id_foreign` (`plan_id`),
  ADD KEY `audit_logs_user_id_foreign` (`user_id`);

--
-- Chỉ mục cho bảng `departments`
--
ALTER TABLE `departments`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `departments_code_unique` (`code`);

--
-- Chỉ mục cho bảng `equipment`
--
ALTER TABLE `equipment`
  ADD PRIMARY KEY (`id`),
  ADD KEY `equipment_location_id_foreign` (`location_id`);

--
-- Chỉ mục cho bảng `locations`
--
ALTER TABLE `locations`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Chỉ mục cho bảng `plans`
--
ALTER TABLE `plans`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `plans_code_unique` (`code`),
  ADD KEY `plans_user_id_foreign` (`user_id`),
  ADD KEY `plans_department_id_foreign` (`department_id`);

--
-- Chỉ mục cho bảng `plan_items`
--
ALTER TABLE `plan_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `plan_items_plan_id_foreign` (`plan_id`),
  ADD KEY `plan_items_location_id_foreign` (`location_id`),
  ADD KEY `plan_items_equipment_id_foreign` (`equipment_id`),
  ADD KEY `plan_items_executor_id_foreign` (`executor_id`),
  ADD KEY `plan_items_mentor_id_foreign` (`mentor_id`);

--
-- Chỉ mục cho bảng `plan_weeks`
--
ALTER TABLE `plan_weeks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `plan_weeks_plan_id_foreign` (`plan_id`),
  ADD KEY `plan_weeks_user_id_foreign` (`user_id`);

--
-- Chỉ mục cho bảng `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`),
  ADD KEY `users_department_id_foreign` (`department_id`);

--
-- Chỉ mục cho bảng `user_activities`
--
ALTER TABLE `user_activities`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_activities_user_id_foreign` (`user_id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `audit_logs`
--
ALTER TABLE `audit_logs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=142;

--
-- AUTO_INCREMENT cho bảng `departments`
--
ALTER TABLE `departments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT cho bảng `equipment`
--
ALTER TABLE `equipment`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT cho bảng `locations`
--
ALTER TABLE `locations`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT cho bảng `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT cho bảng `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=199;

--
-- AUTO_INCREMENT cho bảng `plans`
--
ALTER TABLE `plans`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT cho bảng `plan_items`
--
ALTER TABLE `plan_items`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=122;

--
-- AUTO_INCREMENT cho bảng `plan_weeks`
--
ALTER TABLE `plan_weeks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=90;

--
-- AUTO_INCREMENT cho bảng `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;

--
-- AUTO_INCREMENT cho bảng `user_activities`
--
ALTER TABLE `user_activities`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=307;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `audit_logs`
--
ALTER TABLE `audit_logs`
  ADD CONSTRAINT `audit_logs_plan_id_foreign` FOREIGN KEY (`plan_id`) REFERENCES `plans` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `audit_logs_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `equipment`
--
ALTER TABLE `equipment`
  ADD CONSTRAINT `equipment_location_id_foreign` FOREIGN KEY (`location_id`) REFERENCES `locations` (`id`) ON DELETE SET NULL;

--
-- Các ràng buộc cho bảng `plans`
--
ALTER TABLE `plans`
  ADD CONSTRAINT `plans_department_id_foreign` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `plans_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `plan_items`
--
ALTER TABLE `plan_items`
  ADD CONSTRAINT `plan_items_equipment_id_foreign` FOREIGN KEY (`equipment_id`) REFERENCES `equipment` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `plan_items_executor_id_foreign` FOREIGN KEY (`executor_id`) REFERENCES `users` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `plan_items_location_id_foreign` FOREIGN KEY (`location_id`) REFERENCES `locations` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `plan_items_mentor_id_foreign` FOREIGN KEY (`mentor_id`) REFERENCES `users` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `plan_items_plan_id_foreign` FOREIGN KEY (`plan_id`) REFERENCES `plans` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `plan_weeks`
--
ALTER TABLE `plan_weeks`
  ADD CONSTRAINT `plan_weeks_plan_id_foreign` FOREIGN KEY (`plan_id`) REFERENCES `plans` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `plan_weeks_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_department_id_foreign` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`) ON DELETE SET NULL;

--
-- Các ràng buộc cho bảng `user_activities`
--
ALTER TABLE `user_activities`
  ADD CONSTRAINT `user_activities_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
